{
  "name": {
    "english": "A.B.A",
    "kanji": "アバ",
    "romaji": "Aba"
  },
  "alias": null,
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/8/8b/A.B.A.png/revision/latest?cb=20111017160925",
  "profiles": {
    "race": "Homunculus",
    "gender": "Female",
    "age": "Unknown",
    "height": "174cm(5'8\")",
    "weight": "34kg",
    "blood_type": "Mysteriousliquidcontainingmercury",
    "origin": "Frasco",
    "birthday": "",
    "eye_color": "Green",
    "hobbies": "Observing world affairs, planning for her remaining years",
    "likes": "Paracelsus, herself, anything that is shaped as a key",
    "dislikes": "People who waste things, rivals in love, people who don't care about their friends"
  },
  "description": {
    "info": "A.B.A is a recurring character in the Guilty Gear series. She is a homunculus from Frasco who made her debut in the spin-off Guilty Gear Isuka.\n",
    "design": "A.B.A has sunken eyes, grayish skin and vivacious red hair. Her attire is strange, as it mainly consists of blood-drenched bandages that cover her body, with the only clothing item being a gray skirt with a key hanging on the brown studded belt enveloped around her belly. A gray medical bib hangs loosely over her chest and back, and she wears a brown fingerless glove adorned with a red lock on her left hand. She wears gray shoes, and a black key sprouts from either side of her head.\n",
    "personality": "A.B.A is a very shy person. Since she lived by herself in seclusion for 10 years, she doesn’t have confidence about anything in the “outside” world. She is an artificial life form and has strong principles by nature, but she is also very frightened of competition at times. Due to her complicated personality, she tries to treat others authoritatively, oftentimes using difficult expressions that no one usually uses. There is no hatred towards others in her heart and she can be just as thoughtful as other human beings. A.B.A finds motivation in Paracelsus, her axe, who she decided to take as a partner years ago. He helps her to act positively, however she still lacks cooperativeness at times. A.B.A is of a possessive nature and very jealous when it comes to Paracelsus; there is nothing but pure love for him in her heart.\n"
  }
}