{
  "name": {
    "english": "Anji Mito",
    "kanji": "御津 闇慈",
    "romaji": "Mito Anji"
  },
  "alias": "Brilliance (平沢, Hirasawa?)",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/c/cc/Anji_Guilty_Gear_Strive.png/revision/latest?cb=20220322032102",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "Unknown",
    "height": "183cm(6'0\")",
    "weight": "68kg(150lbs.)",
    "blood_type": "B",
    "origin": "Japan",
    "birthday": "January 1",
    "eye_color": "Black",
    "hobbies": [
      "Vigorous sports, traveling",
      "Researching about That Man (GGST)"
    ],
    "likes": "His beliefs, freedom",
    "dislikes": "Perversity, quibbling"
  },
  "description": {
    "info": "Anji Mito is a recurring character in the Guilty Gear series. A young man of Japanese origin, he chases after That Man out of sheer curiosity. Having run away from the Colony, Anji is in possession of the Zessen which takes the form of fans, and his fighting style involves Japanese dancing steps.\n",
    "design": "Of a muscular frame, Anji has black eyes and always wears small round-framed pince-nez glasses. A white cloth is wrapped around his head, dividing his dark brown, spiky hair in two.\nAs for his outfit Anji is shirtless, wearing only kimono-like sleeves below the shoulders that are connected behind his back; they dark blue with a white layer underneath. He wears a matching hakama tied at the waist with a black belt. Anji also wears blue boots with unusual soles reminiscent of traditional Japanese footwear known as geta, as well as white arm gloves. In his Rev 2 cameo, Anji is seen sporting a loose blue and white kimono resembling his previous outfit, as well his white arm gloves.\nIn Strive, changing his white cloth for a blue bandanna decorated with a white butterfly, Anji—still with a mostly bare torso—retains his connected kimono sleeves but they are shirt-like, covering his shoulders, and are worn above a skin-tight, black garment that covers his upper back and shoulders. He also wears divided hakama below a black outer layer, decorated with a light-blue Mount Fuji and butterflies, held together at the waist by a red cord, and a light brown obi with the kanji 風 (kaze?, lit. wind). His hair and arm gloves are now black, and has replaced his boots with geta and white tabi.\n",
    "personality": "A firm pursuer of adventure  and his own freedom, Anji is a young man who generally acts according to intuition rather than reason.  Because of his impulsive nature, Anji rarely worries about consequences before acting, not because he doesn't care, but because he doesn't really think things through.  Despite not being much of a thinking person, he is a curious man, pursuing knowledge for the sake of knowledge.  Claiming that the more he knows, the happier he gets, Anji doesn't mind risking his life to get the secrets he wants.  Seemingly rather straightforward at first glance, Anji does have a deceptive side, knowing more than he usually lets on,  and will act in a serious manner if the situation demands for it, being more cautious than Chipp. \nAnji often displays a cheerful and light-hearted personality,  and may occasionally make a fool out of  people he is with,  but he means it amicably.  A free spirit, he doesn't attempt to force his own version of justice onto others,  but will not hesitate to show his dissatisfaction towards dishonesty and things he disagrees with. \n"
  }
}