{
  "name": {
    "english": "Answer",
    "kanji": "アンサー",
    "romaji": "Ansā"
  },
  "alias": null,
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/8/83/Answer_REV_2.png/revision/latest?cb=20170121061322",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "Unknown",
    "height": "183cm(6'0\")",
    "weight": "65kg(143lbs.)",
    "blood_type": "A",
    "origin": "Unknown",
    "birthday": "September 8",
    "eye_color": "Blue-green",
    "hobbies": "Visiting secret hotsprings",
    "likes": "His current way of life",
    "dislikes": "Unforgettable memories, losing connection"
  },
  "description": {
    "info": "Answer is a character in the Guilty Gear series. He is described as \"The Business Ninja\" , \"Chief of Staff\", and even as the \"Human Database\". He acts as Chipp Zanuff's Chief of Staff and personal assistant.\n",
    "design": "In Guilty Gear Xrd Rev 2, Answer's design is quite different from how it used to be. He is depicted as a tall, slender, but still muscular man with messy peach hair tied into a large ponytail. He has blue-green eyes. He wears a set of glasses with three lenses, the third covering his forehead. The third lens also contains a symbol on the lens itself resembling a Bindi; it may also be a cross or most likely a shuriken. His outfit is designed to look like a \"Business Ninja\" wearing a black business suit with bronze buttons along the front of the coat and the sleeves. He is a wearing a red shirt underneath, which reaches up his neck to form a lower face mask (his mouth and nose can still clearly be seen underneath). He is also shown to be wearing a red scarf, which may be attached to his shirt/mask or it might be a separate article altogether. He has a white tie, leather finger less gloves, and brown shoes. He is wearing brown business card carriers that are strapped around his shoulders and back. The business cards have Answer's name, picture, and profession on them, which he uses as throwing weapons, similar to kunai or shuriken. He is often seen speaking into a magic headset.\nAnswer's original design was a bit more toned down than his current one. His clothes were pretty much identical save for the lack of business card holders, a scarf, and much larger buttons. His gloves were black instead of brown and much less detailed. His hair was also quite different. In Guilty Gear Xrd -Sign-, his hair is shown to be a dirty blonde and much shorter, his ponytail falling town to his shoulders as opposed to puffing out like a fox tail. In Guilty Gear Xrd -Revelator-, his design was almost completely untouched, but his hair is a faded-out gold and he has the same kind of ponytail as now but much shorter.\n",
    "personality": "He is shown to be straightforward and rational, maintaining a strict and consistent work ethic. He is presented as a professional and anxious man when speaking of government affairs, but defaulting to frustration at Chipp's lack of participation in getting the Eastern Kingdom of Chipp recognized as a legitimate nation by other governments. He can also be sardonic and cynical, showing doubt towards Chipp's intuition and in the past, originally criticized Chipp for his bright ideals. However, he appears to be close friends with Chipp, as he often mistakenly refers to him as \"Boss\" instead of \"President.\" He also expresses a fierce loyalty when Bedman nearly killed Chipp, promising that he would find him and personally take his life if Chipp had died.\n"
  }
}