{
  "name": {
    "english": "Axl Low",
    "kanji": "アクセル＝ロウ",
    "romaji": "Akuseru Rou"
  },
  "alias": "Causal Anomaly (因果律干渉体, Ingaritsu Kanshō-tai?)",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/a/ad/Axl_Guilty_Gear_Strive.png/revision/latest?cb=20191119010847",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "Unknown",
    "height": "179cm(5'10\"or5'11\")",
    "weight": "78kg(172lbs.)",
    "blood_type": "B",
    "origin": "England",
    "birthday": "December 25",
    "eye_color": "Blue",
    "hobbies": [
      "Billiards",
      "Collecting maps from different ages (GGXrdS—)"
    ],
    "likes": "His girlfriend in the past",
    "dislikes": [
      "Preaching",
      "Human death (GGXrdS—)"
    ]
  },
  "description": {
    "info": "Axl Low is a recurring character in the Guilty Gear series. He is a gang leader from the 20th century who, due to a twist of fate, got caught into a time slip that bounces him around irregularly through time and space. He wishes to return to his own time period so as to see his girlfriend, Megumi, once again.\n",
    "design": "Axl has blue eyes and straight blond hair below the shoulder, always covered by a red bandanna; in the first game, it has tulip pattern on it, while from Xrd onwards, it has a white saltire on it. He is quite muscular and of a fair complexion, and always wears brown boots and fingerless gloves.\nIn the original Guilty Gear, he wore a tied white tank top, denim vest and shorts, and boots with the Union Jack on their toe boxes. His next outfit—coupled with a seemingly slimmer build—during Guilty Gear X and XX consists of a Union Jack long-sleeved T-shirt, another denim vest, as well as blue jeans.\nIn Xrd, Axl returns to wearing denim shorts, with two sashes hanging from his belt: one with the Union Jack, the other blue. He also wears a collared white shirt with a black tie, and a rolled-up denim jacket with a white hood. In Strive, Axl sports a dark-grey trouser, and a sleeveless blue shirt with three zipper teeth below a letter jacket. The jacket's body is red with a tartan pattern, while the sleeves are mostly white, and it has black and white print of a clock with \"Thanks Luck\" written above on the back. His bandana is now black instead of red; the saltire remains white, however.\n",
    "personality": "Despite his troubles, Axl retains an optimistic and amiable nature, being a relentlessly \"glass half full\" sort of person,  living by with \"A little sloppiness is just right\" as his personal motto.  Although he rarely thinks about anything very hard, and is generally content to just get the gist of things or go with the flow,  he is very much capable of calmly observing and analyzing a situation  and taking the best course of action when faced with a predicament.  He is not especially good at constructing logical arguments, however (mostly because he tries to find answers that will satisfy everyone), so other people tend not to take him very seriously. \nCompassionate to a fault,  if someone is in trouble, Axl cannot ignore them, and is unable to willingly leave someone behind.  Though he is always getting into fights, and enjoys sparring with others, whenever he loses the strength to throw a punch, he cannot get anything out but tears.   Axl despises the very idea of death,  and refuses to take a life regardless of circumstances. \nWhile he enjoys flirting with other women  and is something of a playboy,  he loves Megumi above all and would never betray her.  Axl wants to return to her side no matter what,  but he has proven that he will do the right thing if he has to choose between the present and the past.  \n"
  }
}