{
  "name": {
    "english": "Baiken",
    "kanji": "梅喧",
    "romaji": "Baiken"
  },
  "alias": [
    "SamuraiSlasher(人斬りサムライ,HitokiriSamurai?)",
    "Sis(姐さん,Anesan?)"
  ],
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/d/da/Baiken_Guilty_Gear_Strive.png/revision/latest?cb=20220322031144",
  "profiles": {
    "race": "Human",
    "gender": "Female",
    "age": "Unknown",
    "height": "162cm(5'4\")",
    "weight": "45kg(99lbs.)",
    "blood_type": "B",
    "origin": "Japan",
    "birthday": "March 5 (presumed)",
    "eye_color": "Peach",
    "hobbies": "Drinking",
    "likes": [
      "Sake bottles (GG—GGXXΛC+R)",
      "Lost everything (GGXrdR2—)"
    ],
    "dislikes": "Tanuki statues"
  },
  "description": {
    "info": "Baiken is a recurring character in the Guilty Gear series. She is a wandering samurai of Japanese descent, whose home was raided by Gears during the Crusades. Having witnessed the horrible deaths of her parents and friends, she has sworn revenge on That Man at any cost.\n",
    "design": "Baiken has long pink hair, which in her first appearance looked reddish-orange, worn in a ponytail, as well as peach eyes. A red tattoo adorns her right eye and forehead, while her permanently-closed left one has a scar over it; in Xrd, she wears a goggle-like eye patch with a tsuba in it, in strive the tsuba was removed . She has a clawed grappling hook in place of her missing right arm alongside other weapons such as a slashing fan, cannon, shotgun, etc.\nAcross her appearances, she wears a red, black and white kimono with a torn right sleeve, as well as black greaves and sandals. In Xrd, Baiken also has a black gakuran with a white skull on its right sleeve, which she wears over her shoulders like a cape. Her sandal footwear resembles boots, and uses a sarashi to cover her groin area. Baiken's hair has become fuller with two tufts pointing upward like cat ears. The sheath of her katana was originally black, but is now red. In her -Strive-, Baiken's hair is noticably more wilder, longer and reddish in appearance. Additionally, the rope around her waist is now pink, as opposed to its previous red color from Xrd.\n",
    "personality": "Deeply traumatized by her loss, Baiken remains bitter over her family's demise and is motivated solely by revenge, wanting to kill That Man beyond reason. A mannish woman and natural-born warrior, Baiken is willing to do whatever it takes for the sake of her goal, and accepts the natural consequences of her actions, having solemnly consigned herself to damnation for her sins. As implied in Λ Core Plus, her quest entails the danger of giving in to her bloodthirsty side, as shown within some of the endings for the game.\nAt the same time, Baiken is coarse, quick to lose her temper and impulsive, often jumping into action before thinking things through. An anti-social person, she seems to value others insofar as they can prove themselves in battle. Baiken tends to stick with her principles, unwilling to back down from a disagreement until it's settled (she can still acknowledge when the other party is in the right). Despite this, she tolerates Anji to a certain extent, but is only on friendlier terms. Baiken uses the pronoun 俺 (ore?), a casual hard masculine that is usually associated with extreme tomboys when used by women.\nHaving struggled with uncertainty in Λ Core Plus, her personality in Xrd seems to have mellowed slightly, allowing her to express herself less crudely towards people. While she still desires revenge for the death of her family, she knows when to prioritize the greater good of her people over her personal vendetta.\nBaiken has a great bond towards Japanese culture, with her being devoted to protect whatever is left of her people. This includes her checking over the colonies and tending to dislike outsiders lurking around them. Should a problem arise though, Baiken is willing to do whatever it takes to save her people, even if it costs her life.\n"
  }
}