{
  "name": {
    "english": "Bedman",
    "kanji": "ベッドマン",
    "romaji": "Beddoman"
  },
  "alias": null,
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/2/29/Bed_image_rev.png/revision/latest?cb=20160526181130",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "Unknown",
    "height": [
      "156 cm (5'1\")",
      "272 cm (8'11\") (including the bed)"
    ],
    "weight": [
      "45 kg (99 lbs.)",
      "666 kg (1468 lbs.) (including the bed)"
    ],
    "blood_type": "A",
    "origin": "Unknown",
    "birthday": "Unknown",
    "eye_color": "Brown",
    "hobbies": "Unknown",
    "likes": "His buckwheat pillow",
    "dislikes": "The cry of the brown-eared bulbul bird, talkative people"
  },
  "description": {
    "info": "Bedman is a character in the Guilty Gear series, who first appears as a playable character in Guilty Gear Xrd -Sign-.\n",
    "design": "Bedman himself is a young man with light purple hair and has a red arrow pointing downwards on his forehead. He wears a purple hospital gown and is nailed to his bed at his shoulders by two large bolts. He also wears glasses.\nThe more noticeable part of Bedman is his eponymous bed. The base of the bed is purple in color, whereas the weapons, limbs and head consist of red, black, gold and purple colors.\nThe mattress which holds Bedman in place is like any other hospital bed you may see. The legs and arms consist of black chain links with purple cords within them. The Bed's hands can transform from either 3 fingered hands, or large spiked wheels. Those wheels bear the word \"Oneiroi\", which refers to dream deities of Greek mythology. The legs are pink with black metal at the tip of the foot, the knee joint, and a spiked wheel at the Bed's \"thigh.\" The wheels on the Bed also grow spikes. The Head is round and has Red Xs for eyes, and has writing that says \"Dreamlike Reality\" on its forehead. It also wears a pink and gold crown atop its head.\n",
    "personality": "Very few people know anything about Bedman’s personality as he sleeps more or less all the time. It is only within the dream world where his true self manifest itself in any fashion.\nBedman is hyper-intelligent, with a vocabulary that daunts even the most well-educated. He excels at identifying his opponent's weaknesses and breaking their spirit by uncovering painful truths they try to hide even from themselves. Incredibly proud, Bedman's condescending attitude keeps him from befriending most people, although given his absolute contempt for others, is probably for the best. For Bedman, the only thing that matters to him is achieving his goals.\nDespite his ruthlessness and contemptuous attitude, Bedman has been shown to be capable of mercy, which he demonstrates by outright refusing to kill Ramlethal after his client demands it; instead, he chooses to teach Ramlethal how to properly feel emotions. When his client asks why he didn't kill her, Bedman responds by saying that he won't kill young girls (which possibly reminds him of his kind sister). He also remembers the names of every person he's killed, in the mistaken belief that after achieving his goal of bringing about the Absolute World, he'll be able to bring them all back from the dead.\n"
  }
}