{
  "name": {
    "english": "Bridget",
    "kanji": "ブリジット",
    "romaji": "Burijitto"
  },
  "alias": null,
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/d/d4/Bridget_Guilty_Gear_Strive.png/revision/latest?cb=20220810001006",
  "profiles": {
    "race": "Human",
    "gender": "Female",
    "age": "Unknown",
    "height": "158cm(5'2\")",
    "weight": "50kg(110lbs.)",
    "blood_type": "O",
    "origin": "England",
    "birthday": "October 26",
    "eye_color": "Emeraldgreen",
    "hobbies": [
      "Yo-yo, napping",
      "Working surreptitiously to be more manly (GGXX—GGXXΛC+R)"
    ],
    "likes": "Her parents, the first yo-yo from her father, her teddy bear",
    "dislikes": "Sea cucumber, shiitake mushrooms, bitter herbs, insects, ghosts, muscles"
  },
  "description": {
    "info": "Bridget is a recurring character in the Guilty Gear series. Born to wealthy parents, Bridget has become a bounty hunter to refute her village's superstitions regarding twins. Wielding a yo-yo in battle, she fights alongside Roger.\n",
    "design": "Bridget has a feminine figure, fair complexion, blonde hair, and wide emerald green eyes. She sports a nun-like attire, wearing a sleeveless blue dress with white hemlines and collar, the latter fastened with a yellow ribbon. Partially covering her hair is a blue thigh-length veil with yellow crosses and white hemlines, attached to a white coif with a cross-shaped metal plate and the male symbol (♂) inscribed. She completes her outfit with black lycra shorts, an enormous metal handcuff in place of a waist belt, black fingerless gloves with white cuffs, white socks below the knee, and boots that compliment the colors of her outfit.\nIn her Strive appearance, Bridget now wears a roll-neck black shirt, below a basmati white long top with a black shawl collar and Empire line ribbon, along with a dark gray pleated skirt. On top of it all, she wears a large light-blue hoodie that bears a resemblance to her previous veil design, the jacket's body being blue, and its puffy sleeves white in color. On the coif-like white hemline of her hood is a golden androgyne symbol (⚨) accessory; meanwhile, golden crosses adorn the sleeves at the elbows. Small changes include her fingerless gloves now being white on the palm area, and her handcuff belt having a chain attached to it. Her boots, socks, and lycra shorts remain the same.\n",
    "personality": "Gentle and easygoing, Bridget can also be a bit of an airhead. She likes having fun, but often lets things get out of hand, which can cause a lot of trouble for anyone nearby. She seems unaware of this particular flaw.  Given the best education her parents could afford, she is a young lady of unimpeachable propriety,  often being polite even against the wanted criminals who are her marks.   Bridget also likes to showcase her skills—as a bounty hunter  or as a yo-yo performer —, likely as a result of wanting to prove her worth before her hometown.\nShe has a cheerful-against-all-odds personality, and is very committed to reassuring her beloved parents,  going so far as putting on a happy front for them.  Picking up the yo-yo wasn't only a hobby to occupy her time, but also to show them she was happy. \nIn XX, thinking that it would contribute to changing her village's beliefs,  Bridget attempted to surreptitiously be more manly,  and was quick to confirm her gender as male whenever people mistook her for a girl.  At the same time, she almost invariably refers to herself with the pronoun 家 (uchi?), mostly employed by females, using 僕 (boku?) privately only once, in a family context.  Upon accomplishing her goals of finding success as a bounty hunter and bringing wealth to her village, Bridget finds herself searching for purpose in Strive;  although she admits to being a boy upon being called a \"li'l lady\", her lack of confidence is notable, and seems uncertain about what others—even her family—may think about her choosing to live as her true self. \n"
  }
}