{
  "name": {
    "english": "Chipp Zanuff",
    "kanji": "チップ＝ザナフ",
    "romaji": "Chippu Zanafu"
  },
  "alias": "Boss",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/4/43/Chipp_Guilty_Gear_Strive.png/revision/latest?cb=20191119011047",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": [
      "16(TBaHG)",
      "18(TBaHG)",
      "22(GG)",
      "23(GGX—GGXXΛC+R)",
      "24(TBaHG)",
      "26-28(GG2)",
      "29(GGV—)"
    ],
    "height": "183cm(6'0\")",
    "weight": "67kg(148lbs.)",
    "blood_type": "B",
    "origin": "United States (he insists Japan)",
    "birthday": "February 9",
    "eye_color": "Red",
    "hobbies": [
      "Dreaming",
      "Becoming president (GGXrdS—)"
    ],
    "likes": [
      "Sleeping pills (GG—GGXXΛC+R)",
      "Friends, glasses, (the necktie & fountain pen he'll eventually buy) (GGXrdS—)"
    ],
    "dislikes": "Nightmares, the mafia, gangs, yakuza"
  },
  "description": {
    "info": "Chipp Zanuff is a recurring character in the Guilty Gear series. A former drug trafficker and addict, Chipp struggled in the streets of his hometown until a man called Tsuyoshi took him into his care. He trained Chipp in the arts of Ninjutsu until his death at the hands of a syndicate.\n",
    "design": "Chipp is portrayed as a muscular, yet slender young man with red eyes and earrings, and with white hair sticking out in all directions. He invariably wears a black tank top—which resembles a leather jacket—tucked into a pair of white trousers with two straps on the left hip, shod in high closed shoes with large buckles. He is equipped with a short, curved silver blade attached to his right wristband that goes up along his arm to his shoulder.\nHis Xrd appearance has some changes, such as red accents on his belts, a red sash, and a prominent ninja star on his vest. He also puts on a pair of glasses in his victory pose. His Strive look has him wearing harem trousers, a light brown obi-like rope, and black sandals in conjuction with his black jacket vest, red sash, and black wristbands.\n",
    "personality": "Chipp is a straightforward and simple-minded man, impatient and quick-tempered, unable to get angry for a long time. More of a street-brawler than anything else, the hot-headed Chipp is not much of a thinker, but has a great intuition in the form of hunches. His methods are crude, but the morality he learned from his master, Tsuyoshi, never wavers. Chipp rarely loses hope, constantly striving to become stronger and improve his skills, and believes that failing is simply a chance to improve.\nAs Tsuyoshi was Japanese, Chipp possesses a great love of Japan, and even claims to have been born there, but his image of the country is largely idealized and has little to do with reality. Chipp's non-Japanese origin is given away by his speech: some of his lines during combat consist only of Japanese words known to foreigners (\"harakiri\", \"kamikaze\", \"sushi\", \"sukiyaki\", \"Fujiyama geisha\", etc.), and whenever he is surprised he will exclaim \"What?\" (ワット?) in English.\n"
  }
}