{
  "name": {
    "english": "Dizzy",
    "kanji": "ディズィー",
    "romaji": "Dizī"
  },
  "alias": [
    "GearwithFreeWill",
    "PrincessoftheGears(ギアの姫,GianoHime?)",
    "ChildofLightandDarkness(光と闇の結晶,HikaritoYaminoKesshō?)",
    "MissBounty(賞金首さん,Shōkinkubi-san?)",
    "MaidenoftheGrove(木陰の君,KokagenoKimi?)"
  ],
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/f/f5/DizzyRev.png/revision/latest?cb=20160719192242",
  "profiles": {
    "race": "Half-Gear/Human hybrid",
    "gender": "Female",
    "age": [
      "3(GGX—GGXXΛC+R)",
      "6-7(GG2)",
      "8(GGV—)"
    ],
    "height": "167cm(5'6\"or5'5\")",
    "weight": "56kg(123lbs.or124lbs.)",
    "blood_type": "Unanalyzable",
    "origin": "Unknown",
    "birthday": "December 25 (presumed)",
    "eye_color": "Red",
    "hobbies": "Grooming her wings",
    "likes": [
      "Foster parents, forest animals (GGX—GGXXΛC+R)",
      "Everyone she can call family, those who helped her in the forest (GGXrdR2—)"
    ],
    "dislikes": [
      "Poachers (GGX—GGXXΛC+R)",
      "Conflict (GGXrdR2—)"
    ]
  },
  "description": {
    "info": "Dizzy is one of the main characters of the Guilty Gear series. An innocent and pacifist command-type half-Gear, Dizzy is the daughter of Justice, who once waged war on all of humanity, but grew up unaware of her origins. The names of Dizzy's shapeshifting wings, also called her guardians, are Necro and Undine.\n",
    "design": "Most notable in Dizzy are her \"systems\" or guardians—her dark green right wing, Necro, and her white left wing, Undine, and her black, salamander-like tail. Usually taking the form of mere differently-colored wings, they can transform into a humanoid shape joined at the hips with Dizzy's back. They take the form of a grim reaper and a water spirit, respectively, and can cover Dizzy partially or entirely.\nDizzy has three main attires. Her black dress in Guilty Gear X has a long skirt that reaches up to the ankle, low laced off-shoulder neckline and fitter sleeves. Her usual outfit, the one she wears during battle, is a tight, provocative suit, with two belts crossed over barely covering her chest area with her midriff exposed, and white, puffy sleeves cover her arms. In Revelator, a buttoned shirt-like panel is added for a more conservative look, and feather-like plates replace the puffy sleeves. Her third outfit is her Jellyfish Pirates uniform that includes a short sailor top and jeans shorts. Her boots are the same.\nHer dark blue hair is very long, reaching down to her knees, and her eyes are red like other Gears. Dizzy is fond of yellow ribbons, as she has two on her ponytails and one on her tail.\n",
    "personality": "As a half-Gear, despite her chronological age, Dizzy has matured at a rapid rate. Given her kind's superior ability to absorb and process information, by the age of three, she is essentially equivalent to an adult human,  mentally older than a 20-year-old.  Gentle and kind towards those she encounters, Dizzy has a motherly demeanor  coupled with an honest heart and a pure mind. \nShe loves nature and humanity, and strongly opposes all conflict,  and is very polite. Her immense power and her lack of control over her guardians—who have a will of their own, of which Necro is a personification of her violent instinct,  while Undine seems to be one of her self-preservation —only causes her grief, as she sees it as a curse, fearing to hurt others.   Yet, while she resists violence when she can, Dizzy isn't necessarily a pacifist, as she understands destruction is simply part of the cycle of life. \nDue to her persecution by humans, Dizzy initially distrusts them  and isolates herself, but this only causes her more sadness, as she longs for human contact. Before she met Testament, Dizzy's solitude was such that her only wish (if she had one) would be to have a friend, someone who would accept her even as she was.  As a result, Dizzy places a lot of importance in her found family and friends—enough to fiercely fight to protect them.\n"
  }
}