{
  "name": {
    "english": "Eddie",
    "kanji": "エディ",
    "romaji": "Edi"
  },
  "alias": null,
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/2/26/Zato_Guilty_Gear_Strive.png/revision/latest?cb=20220322033048",
  "profiles": {
    "race": "Forbidden Beast",
    "gender": "Male",
    "age": "Unknown",
    "height": "",
    "weight": "",
    "blood_type": "",
    "origin": "",
    "birthday": "",
    "eye_color": "Red",
    "hobbies": "",
    "likes": "",
    "dislikes": ""
  },
  "description": {
    "info": "Eddie, also spelled as Eddy, is a recurring character in the Guilty Gear series. He is the shadow Forbidden Beast attached to Zato-ONE, granting him his shadow manipulation abilities.\n",
    "design": "Eddie used the once-deceased corpse of Zato as a sort of \"human skin\". Aside from that, Eddie is an amorphous mass of black shadow that can take the shape of just about anything imaginable. His preferred form, and most common depiction, is a completely black silhouette of a tall, muscular male with an unusually thin waist, elbow spikes, a gargoyle head and glowing red eyes.\nEddie appears to possessed a glowing void of red \"core\" in place of organs which are shown in his eyes, his body markings and inside his body during some of his attacks.\nCuriously, Eddie is also shown to have some form of tangible body structure. In XX series, Eddie's Dust attack involving him peeling off his mouth and strikes his opponent with his own skulls. The skull is that of a cow but with curved horns and of massive size, as large as his entire body. It also has a natural bone color instead of the usual black color. This suggested that this skull is real and not a polymorphed shadow, and that Eddie's true form maybe far larger than he appears.\nDuring the event of the original Guilty Gear, while Zato was still being in control of his body. Eddie's gargoyle form was much more beastial in appearance, sporting long spiked tendril hair, enlarged beak and raptor-like talons. He also has white glow on his eyes and body outline instead of red.\nIn XX series, Eddie's overall design is much more organic but also more simple in appearance. Eddie has more expressive facial features, natural-looking musculature and lacking any bodymarks. His shadow hue is also lighter in colour. Eddie's body also periodically glows up. And in-game explanation is that the glow was used to differentiate Eddie from Zato, whom in GGX lacks the glow. While Gameplay explanation is that it was used to prevents Eddie's dark palette from melding into the background and gain unfair advantage.\nIn Xrd series, Eddie still retained his overall appearance from XX but has been redesigned to be more angular and detailed, in particularly his head crest which are now more robotic looking. He now sports an unknown scriptures on his forehead and has a glowing red marking in a shape of a crescent line with 5 wedges running along it on his chest. His eyes and mouth are motionless, locked in place and perpetually opened. Instead of the glow, Eddie in Xrd has a red body outline instead.\nIn Strive, Eddie has a much more minimalistic design, appearing as an actual shadow in humanoid shape with wings and a pointed head with no visible neck. He sports red eyes and a row of white human teeth. \n",
    "personality": "Eddie's personality is similar to that of his host, due to inheriting his memory and personality during his incubation, but he is notably deranged and sadistic. When not desperately seeking out host bodies, he often ponders the meaning of his existence, as well as the meaning of life in general.\nIn combat, Eddie fights with a distinct brutality and viciousness as shown in most of his movements and techniques, all of which are gradually toned down or outright changed as Zato regaining control of both his body and Eddie. \nHe also struggles with trying to define his own identity as a unique individual, which is often met with frustration and anguish when confronted with the fact that he has the same persona and memories as his host. As an Anti-Gear weapon, he also possesses pre-programmed memories of the Crusades and instincts to eliminate Gears.\nIn Strive, Eddie usually imitates the emotion of Zato, such as pain when being hit with Faust's overdrive\n"
  }
}