{
  "name": {
    "english": "Elphelt Valentine",
    "kanji": "エルフェルト=ヴァレンタイン",
    "romaji": "Eruferuto Varentain"
  },
  "alias": "El (エル, Eru)",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/c/cd/Elphelt-img.png/revision/latest?cb=20160526224251",
  "profiles": {
    "race": "Valentine",
    "gender": "Female",
    "age": "Unknown",
    "height": "168cm(5'6\")",
    "weight": "Dreamkg",
    "blood_type": "\"Mysterious\"",
    "origin": "Backyard",
    "birthday": "December 25",
    "eye_color": "Lightblue",
    "hobbies": "Romantic discussions, pretending to be a bush dog",
    "likes": "Smiling faces, saving up for a bush dog, anything sweet",
    "dislikes": "Any kind of bug, killing, loneliness"
  },
  "description": {
    "info": "Elphelt Valentine is a major character in the Guilty Gear series. She is one of the Valentines created by the Universal Will, alongside her sister Ramlethal. Somewhat obsessed with finding a suitable husband, she does not wish to follow her mother's directive of destroying humanity.\n",
    "design": "In Sign, Elphelt has pink hair, green eyes, and wears a primarily white dress resembling a wedding dress, accented with red belts and pink ribbons with clover symbols. Her most notable features are the bouquet of large red roses she carries around, and her revealing bust window.\nIn Revelator, Elphelt received a new design. Her colors, except for her eyes and smaller details across her outfit are now completely grayscale (with her pink hair changed into light grey, and the red belts on her design to black). She now wears large spiked belts across her neck and wrists, and her dress is given a darker, more gothic motif, along with being open in the front, exposing more of her legs and cleavage. The roses strapped to her waist are now in a black bouquet, the pink clover on her head accessory is changed to mint, and the pupils in her eyes are smaller.\nFollowing her rescue, Elphelt gains a new outfit while her hair is shortened to a bob style.\n",
    "personality": "Unlike her predecessors, Valentine and Ramlethal, Elphelt is bursting with personality. She is capable of feeling emotions as any other human would in order to accommodate to her purpose: to infiltrate human society.\nElphelt is a kind-hearted lover of nature and animals, and never ignores those who are lonely or in pain. She always tries to exemplify the pinnacle of femininity, only to fail repeatedly, and focuses on the concept of \"womanhood\". She is also optimistic and stubborn, to the point where it is very difficult to dampen her mood or change her mind. \n"
  }
}