{
  "name": {
    "english": "Faust",
    "kanji": "ファウスト",
    "romaji": "Fausuto"
  },
  "alias": "Dark Wandering Doctor (流浪の闇医者, Rurō no Yami Isha?)",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/3/3e/Faust_Guilty_Gear_Strive.png/revision/latest?cb=20220322054245",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "Unknown",
    "height": "282cm(9'4\"or9'3\")",
    "weight": "55kg(121lbs.)",
    "blood_type": "Unknown(O)",
    "origin": "Unknown (China)",
    "birthday": "Unknown (August 21)",
    "eye_color": "Fluorescent",
    "hobbies": "Collecting high-quality paper bags",
    "likes": "Believes it's not good to have such things",
    "dislikes": "Those who have framed him"
  },
  "description": {
    "info": "Faust is a recurring character in the Guilty Gear series. He is a medical genius gone insane and sane once more, and is one of the most unorthodox characters in the series. Having discarded his old identity, Faust is an itinerant, miraculous healer dedicated to saving everyone in order to atone for his sins.\n",
    "design": "Faust's extreme height and light weight give him a bizarre, tall, lanky physical appearance, and allows him to tower over every other character in the series—although he rarely does, due to his extremely low fighting stance. He wears a paper bag as a mask with one eyehole, which in one of his Taunts he takes off to reveal a glowing bald head and obscured face, and wields a giant scalpel as a weapon.\nFaust's classic outfit consists of a collared, light-blue shirt with a black or yellow tie, green pants, and a stylized white coat with several big steel bolts on his shoulders and black belts. In Xrd, the bolts have \"Stimulation\" engraved onto them, the back of his jacket reads \"A merry heart doeth good like a medicine\" and his paper bag says \"Wandering Doctor Faust\" upside down.\nIn Strive, Faust receives a major redesign: He wears simple light-blue scrubs, white gloves, a stethoscope around the neck, a red syringe dangling from his waist, and mostly-white sneakers. It exposes an extremely skinny build and a stitched patch on the right side of his chest area. In \"Another Story\" centering Delilah eventually explain how his physical and mental condition becomes weakened.\n",
    "personality": "Going mad shattered whatever Faust's personality might have been, and even though he regained his sanity, a good deal of that wreckage is now permanent.  And yet, contrary to his eccentric style and transportation methods, it is only in the battlefield that he can be described as \"wacky\".\nWhile his behavior remains erratic, the compassion and generosity he was once known for have returned undimmed.  When it comes to saving lives, Faust behaves like a normal doctor and is completely serious about helping those in need   as a way to atone for his sins and past,  even as he believes that his sins can hardly be wiped away.  He does often talk complete nonsense, but he is just as (if not more) likely to say something profound that will help others find their paths in life.  Usually respectful towards others, Faust's resolve to save lives is not limited to humans, caring equally for non-humans that may need his help.\nAs silly as Faust may seem, the doctor's bloodthirsty side still looms over him, even becoming unstable at the sight of blood,  but he keeps it under tight control.  Indeed, even when confronting the two people responsible for the mishap that ruined his life, Faust's first and foremost priority is saving lives, even as he feels the powerful urge to slaughter them.   In his dedication to prevent harm to others, he is fierce towards enemies like I-No and does not hesitate to fight seriously if needed. \nIn Strive, confronting those responsible has changed him. Forgiving Chronus, Faust now seeks atonement from him rather than reliving his resentment. Yet, while he has decided to keep living as a doctor rather than judging himself for his past mistakes, Faust subconsciously believes that he should be punished for his crimes, and his way living can be seen to be as someone \"looking for a place to die,\" his past and current self overlapping in an complex way. \n"
  }
}