{
  "name": {
    "english": "Giovanna",
    "kanji": "ジオヴァーナ",
    "romaji": "Jiovāna"
  },
  "alias": "Gio",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/c/c7/Giovanna_Guilty_Gear_Strive.png/revision/latest?cb=20220322045947",
  "profiles": {
    "race": "Human",
    "gender": "Female",
    "age": "Unknown",
    "height": "170cm(5'7\")",
    "weight": "62kg(136lbs.)",
    "blood_type": "O",
    "origin": "Brazil",
    "birthday": "November 6",
    "eye_color": "Blue",
    "hobbies": "Moongazing",
    "likes": "Her spirit wolf companion, her unique sense of professionalism",
    "dislikes": "The smell of cigarettes and alcohol"
  },
  "description": {
    "info": "Giovanna is a playable character in the Guilty Gear series who makes her debut on Guilty Gear -Strive-. Accompanied by a wolf spirit called Rei, Giovanna is an officer in the special operations unit that protects the President of the United States.\n",
    "design": "Giovanna has red hair and a tanned skin complexion. She is dressed in business casual attire, a loosely worn white shirt with bright green pulled up sleeves, baggy olive green dress pants with suspenders and belts, as well as light brown fingerless gloves and white-green heeled boots.\nShe is accompanied by Rei, a green wolf spirit with black snout and legs (with the legs being hidden during most of gameplay), whited-out eyes, and an orange recycling symbol around a heart on its forehead.\nWhen possessed by Rei, Giovanna gains a few of Rei's features. Her skin goes a light green and her eyes become white alongside their symbol placed on her forehead. Her hair becomes a lighter red as well. \n",
    "personality": "Giovanna is said to be careful with her words, but still manages to come off as rude and irreverent due to her attitude. Deep down, though, she means well and is especially friendly with children and animals. Due to the unique environment she grew up in, she can also be a bit lacking in social skills at times. Rei, her spirit wolf companion, is like family to Giovanna and fights at her side.\nDespite her position as a special forces officer, Giovanna also comes off as lazy, but when push comes to shove, she handles matters as a professional.\n"
  }
}