{
  "name": {
    "english": "Goldlewis Dickinson",
    "kanji": "ゴールドルイス＝ディキンソン",
    "romaji": "Gōrudoruisu Dikinson"
  },
  "alias": "Secretary of Defense (国防長官, Kokubō Chōkan?)",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/f/fe/Goldlewis_Guilty_Gear_Strive.png/revision/latest?cb=20220322044820",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "Unknown",
    "height": "214cm(7'0\")",
    "weight": "257kg(566lbs.)",
    "blood_type": "A",
    "origin": "United States",
    "birthday": "October 9",
    "eye_color": "Blue",
    "hobbies": "Investigating UMA",
    "likes": "His Miles Davis records, cherry pie",
    "dislikes": "People who believe in ghosts and UFOs"
  },
  "description": {
    "info": "Goldlewis Dickinson is a playable character who makes his debut in Guilty Gear -Strive-. The current Secretary of Defense of the United States of America, Goldlewis is the right hand of president Vernon and formerly of Erica Bartholomew.\n",
    "design": "Goldlewis has light blond hair arranged in a quiff and a thick beard. Though he wears a pair of glasses with the left side blacked out with a lipstick mark, silver bolts and small text on it, both of his blue eyes are functional. \nHe is a large, wide-set man. His outfit consists of a brown military-style jacket laden with badges on the arms and rolled-up sleeves, over a pale light-brown shirt with stars on the collar, a deer skull necklace, and a yellow tie. He wears brown cowboy-style chaps, grey trousers below them, as well as thick boots. His brown, fingerless gloves have horseshoes on the back of the hand.\n",
    "personality": "A reliable man whose presence is a pillar of support to the security and authority of his country,  Goldlewis' sincere and good-natured traits have earned the trust of both Vernon and Erica,  who know him to be both loyal and funny.  He is also well-known for his excellent judgment and ability to lead, based on his extensive combat experience, which has garnered immense popularity.  He also seems to be punctual and exacting, expecting the same from his subordinates, as well as quite fearsome when irritated. \nAlthough his hobby is searching for and collecting unidentified organisms,  Goldlewis doesn't believe in aliens  or ghosts,  insisting that the coffin he carries around contains a cryptid, even as the entity's features point to it being an extraterrestrial. \n"
  }
}