{
  "name": {
    "english": "I-No",
    "kanji": "イノ",
    "romaji": "Ino"
  },
  "alias": [
    "MusicianinRed(紅の楽師,KurenainoGakushi?)",
    "CrimsonMinstrel",
    "TheCalamity(災厄,Saiyaku?)"
  ],
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/9/93/I-No_Guilty_Gear_Strive.png/revision/latest?cb=20210322020009",
  "profiles": {
    "race": "Human (Magical Foci)",
    "gender": "Female",
    "age": "Unknown",
    "height": "165cm(5'5\")",
    "weight": "46kg(101lbs.)",
    "blood_type": "AB",
    "origin": "Unknown",
    "birthday": "November 25",
    "eye_color": "Multicolored",
    "hobbies": "Anything fun, coded word games, teasing",
    "likes": "The first is a secret, her guitar, youth",
    "dislikes": "People who don't let her have fun, milk"
  },
  "description": {
    "info": "I-No is a major character in the Guilty Gear series. She is a time-travelling musician who seems to derive pleasure from tormenting others, and is one of That Man's three servants alongside Raven and Jack-O' Valentine. Very little is known about her, with a report in Guilty Gear XX that consists entirely of \"UNKNOWN!!\" repeated several times over.\n",
    "design": "I-No has black hair in a bob cut, a fair complexion, red lips and a mole on her left cheek. While she is normally depicted as having green eyes in artwork, her irises are multicolored, which means—as shown in-game in Guilty Gear Xrd—that they shift constantly.\nI-no wears a red witch hat that has a skull face on it. Her black leather choker with a gold ring around the neck is connected to her shoulderless red jacket that she can easily take off and put on. She has a red mini-skirt and thigh high heel boots, and black fingerless gloves. She is always carrying her Surf Green-colored Duesenberg Starplayer II guitar named Marlene.\nThis remains basically the same up until Strive, where she gains the addition of a black short-sleeved top with an open collar and a bra-like design. Her iconic red jacket is no longer connected to her choker, and bears prominent Venus symbols on the folds. Instead of her miniskirt she wears short-shorts that are open on one side, along with two long flowing coattails that are attached to a large belt. The belt bears a golden cross and there is a also a silver nine. Lastly, her hat now bears a silver ankh toward the top.\n",
    "personality": "Wicked and cruel,  I-No is a manipulative woman who seems to have no qualms about hurting other people,  and for whom people have no meaning beyond their ability to amuse her.  She has no problem acting personable  if she wants to,  but she considers all of humanity to be beneath her—That Man included—, and has a vicious nature that quickly rises to the surface whenever someone challenges her.  I-No also has no problem using her feminine features to manipulate  and deceive men;  her every word and action bursts with sexuality,  usually using musical references as double entendres.\nFully aware of her own eccentricities,  she claims to be dedicated to That Man's goals and ideals,  and is intrigued by his scheme,  but in truth, she only works for her own agenda. Self-reliant to a fault, and unwilling to throw away her own will no matter what,  I-No is motivated by a fixation with what she calls \"tomorrow\" due to her origins. \nDespite her selfish demeanor, I-No has shown some flashes of remorse at her impulsive reactions, specifically with Axl   (perhaps due to being fellow \"vagabonds\")  and, to a lesser extent, with Raven.  Her apathy—not unlike Raven's—seems to be a result of reality becoming akin to a piece of fiction to her, her time manipulation powers making I-No lose all sense of value. \n"
  }
}