{
  "name": {
    "english": "Jack-O' Valentine",
    "kanji": "ジャック・オー＝ヴァレンタイン",
    "romaji": "Jakku-Ō Varentain"
  },
  "alias": [
    "Scales/BalanceofJuno(ユノの天秤,YunonoTenbin?)",
    "Jackie(ジャックちゃん,Jakku-chan?)"
  ],
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/b/bf/Jack-O_Guilty_Gear_Strive.png/revision/latest?cb=20220322053116",
  "profiles": {
    "race": "Valentine",
    "gender": "Female",
    "age": "Unknown",
    "height": "165cm(5'5\")",
    "weight": "45kg(99lbs.)",
    "blood_type": "O",
    "origin": "Unknown",
    "birthday": "December 13 (decided by herself)",
    "eye_color": [
      "Reddish-brown(GGXrdR)",
      "Green(GGST)"
    ],
    "hobbies": "Thinking of new methods",
    "likes": "Candy, memories, novel ideas",
    "dislikes": "Scientific ideas"
  },
  "description": {
    "info": "Jack-O' Valentine is a recurring character in the Guilty Gear series. She is one of the three servants of That Man, alongside Raven and I-No. Her past is shrouded in mystery, and her own memories are vague. Because her awakening remains incomplete, she can't function without her mask and candy.\n",
    "design": "Jack-O' Valentine is a slender young woman with fair skin, red eyes and long white hair with red highlights on the underside that goes past her hips. Her most prominent trait is the compass-like pale yellow halo hovering above her head.\nJack-O's main outfit consists of a white skin-tight one piece that loosens up and has slits at her forearms and calves. She wears an ankh pendant, a black belt with a gold skull buckle on her waist, and her arms are decorated with similar belts. She also wears black and red gloves and matching heels. She also wears a Jack-o'-lantern-esque removable mask and prison weight chained to her left ankle. Both are black in color and give off a light green lantern effect in their skull-themed eyes, nose and mouth. At the end of Revelator, her hair becomes fully red.\nIn Strive, Jack-O's design remains mostly the same, with the only differences being that her hair color changing to being predominantly red with white highlights on the underside, her eye color changing from red to green, as well as her halo becoming cracked.\n",
    "personality": "Because she was awakened in an incomplete state,  before she could download half of her soul from the main body, her memories and personality data are fragmented and unstable.  This instability has resulted in the side-effect  of a split \"personality\" of sorts: That of a cool and collected  adult woman,  and a child-like one that is playful and cheerful, with her voice changing accordingly. The way she refers to others changes as well: her child voice using the honorifics ちゃん (-chan?)  and くん (-kun?),  while her adult voice drops them almost entirely and uses a more neutral tone. Despite the changes, Jack-O' does not actually become a child on the inside. \nInside her remains the portion of Aria's soul that loved Frederick, and related memories;  at first, not quite able to recall information of him  or his name,  she was created with a complicated feeling of nostalgia towards Sol.  Being \"a piece of Aria\",  Jack-O' doesn't consider herself to be Aria, whom she has called the \"original owner\" of her body,  thinking of herself as a temporary, replacement personality  with artificial emotions.  Although she finds unsettling that \"nothing\" is all she has,  she is nonetheless well aware of her destiny or purpose —protecting the world  —and is willing to fulfill it despite what that may mean for her own existence. \nYet, while thinking of herself as disposable, Jack-O's ego starts to become independent, refusing to take off her halo after becoming human.  Though she claims otherwise  so that others won't notice, Jack-O' knows she has emotions, even if she may not fully feel them. Unable to accept herself, she doesn't reject herself either, falling in love with Sol despite herself. \nInitially, not having \"established\" herself in this plane of existence, Jack-O' needs some candy as a supplement, or wear her mask,  but as days pass and she stabilizes, she is able to forego their use.    Following the fusion, she remains in an unstable state due to Aria's consciousness within her, and may start acting child-like again if her emotions get the best of her; to keep her composure in check during battles, she continues to use her mask. \n"
  }
}