{
  "name": {
    "english": "Jam Kuradoberi",
    "kanji": "蔵土縁 紗夢",
    "romaji": "Kuradoberi Jamu"
  },
  "alias": "Iron Fist Chef",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/d/de/Jam_Xrd.png/revision/latest?cb=20160526230307",
  "profiles": {
    "race": "Human",
    "gender": "Female",
    "age": "",
    "height": "163cm(5'4\")",
    "weight": "Secretlbs",
    "blood_type": "B",
    "origin": "China",
    "birthday": "February 8",
    "eye_color": "Brown",
    "hobbies": "Cooking, observing, research",
    "likes": [
      "Kitchen, youth, beautiful men",
      "A restaurant that won't burn down (GGXrdR—)"
    ],
    "dislikes": [
      "Indecisive men, ignorance",
      "Real-estate running at a loss (GGXrdR—)"
    ]
  },
  "description": {
    "info": "Jam Kuradoberi is a recurring character in the Guilty Gear series. She is of Chinese descent, and is one of the few characters in the game who fights bare-fisted, supplemented with Ki force. She is a talented chef and a restaurant owner, whose business is constantly set back.\n",
    "design": "Jam stands 5'4\" tall, with long brown hair worn in a waist-length loop and secured at the top of her head with a \"Pokka\" Oolog tea can. She has brown eyes, fair skin, and an athletic physique.\nJam's costume is a tight-fitting Chinese-styled dress of red silk and black trim. It has no sleeves and falls to about the top of her thighs and is cut high over the hip. Under this she wears a second skirt, which is white with red trim and about the same length as the red dress (but it covers her hips, which the red dress doesn't). On her arms she wears wide \"sleeves\" made from red silk with black trim. These sleeves are held on by straps at her upper bicep. On her feet Jam wears high-heeled red boots with black trim.\n",
    "personality": "Jam is a woman who often jumps to conclusions and is quick to make decisions, while taking the consideration of others into account. In Guilty Gear XX, she immediately got into fights with the other characters, suspecting them as the arsonists who burnt her restaurant down. Jam also takes great pride in her Chinese heritage and skill in both fighting and cooking, often using food as a reference. Overall, she is a very energetic person who is sometimes a little silly, but still tries to establish friendships.\n"
  }
}