{
  "name": {
    "english": "Johnny",
    "kanji": "ジョニー",
    "romaji": "Jonī"
  },
  "alias": [
    "Studmaster",
    "JohnnyoftheSevenSeas",
    "Mr.J"
  ],
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/c/cc/Jhn_image_rev.png/revision/latest?cb=20160526182634",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "Unknown",
    "height": "184cm(6'0\")",
    "weight": "72kg(159lbs.)",
    "blood_type": "O",
    "origin": "United States",
    "birthday": "October 24",
    "eye_color": "Blue",
    "hobbies": "Finding good women",
    "likes": "Prized guitar collection",
    "dislikes": "People who don't get jokes"
  },
  "description": {
    "info": "Johnny is a recurring character in the Guilty Gear series. He is the captain of the female-only Jellyfish Pirates, a group of sky pirates sworn to help those less fortunate, who are known all around the world. Johnny's flirty, debonair demeanor hides a man dedicated to the noble idea of caring for others and a mastery of the battou sword style.\n",
    "design": "Johnny is a tall, muscled individual of fair complexion. Johnny has blue eyes and long blond hair, which he usually keeps in a pony-tail, but changed it to a short, slick hairstyle in the Xrd games. He is always wearing a wide-rimmed cowboy-style hat (which bears a skull insignia in XX, and a letter \"J\" pin in Xrd) and a pair of dark sunglasses.\nInvariably shirtless, Johnny sports a black outfit, sparsely adorned with golden beads. The outfit consists of long, well-fitting pants, a large gunslinger-style belt worn diagonally, and a long collared trench coat, left unbuttoned to ensure his chest remains visible. He wears brown fingerless gloves to complete his outfit. In battle, Johnny wields a shirasaya katana of plain undecorated wooden mounting.\n",
    "personality": "Johnny is a daring, suave, and flamboyant man who likes old-fashioned language and fools around, being a \"free spirit\" who has no intention of settling down any time soon. A bit self-absorbed, Johnny appreciates his own physical appearance, frequently commenting on it to others throughout the series, and is a notorious gambler.\nHe is also a peerless lover of women, claiming that it is his duty to provide love for all the ladies in the world. A compulsive womanizer, Johnny has expressed interest in nearly every female character he encounters, includingBridget prior to her transition (whom he initially mistakes for a girl). He rarely welcomes men into his ship, although Testament seems to hang around sometimes.\nBeneath his swash-buckling, somewhat surly persona, Johnny has a big heart. He has a chivalrous personality and a strong sense of duty, and often goes out of his way to protect the weak. In a pledge to save the lonely, Johnny founded the Jellyfish Pirates in order to help those less fortunate than himself. He cares for his crew very deeply, often going to great lengths to protect them from harm, and reassuring them on numerous occasions that they are family to him. While he trusts them with his life, Johnny is nevertheless a shrewd, secretive individual, often keeping his intentions to himself, and has one ironclad rule according to Haehyun: He doesn't rely on others unless he is truly at his wit's end.\n"
  }
}