{
  "name": {
    "english": "Judgment",
    "kanji": "ジャッジメント",
    "romaji": "Jajjimento"
  },
  "alias": "The Judge",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/b/b8/Raymond_Portrait.png/revision/latest?cb=20111210233500",
  "profiles": {
    "race": "Unknown",
    "gender": "Male",
    "age": "",
    "height": "",
    "weight": "",
    "blood_type": "",
    "origin": "",
    "birthday": "",
    "eye_color": "",
    "hobbies": "",
    "likes": "",
    "dislikes": ""
  },
  "description": {
    "info": "Judgment is a character in Guilty Gear Judgment. He is the final boss, as well as a powerful unlockable character. He can be unlocked by collecting all of the letters that spell his name in Stage 6-1.\n",
    "design": "As Raymond, he appeared as a slightly tall and lanky male with long blond hair, wore glasses and a simple longcoat. After transforming into Judgment, his hair shortens and spikes upward, his skin blackens and his eyes glow. While he gains impressive upper body stature, his lower body gains a polarizing female build. He adorns a dark blue coat with yellow lining highly resembling the same coat worn by the Holy Knights. He wears a pair of steel cuffs with chains covering his arms. Behind him is an array of plates with an eye on each. These can transform and fuse together for a plethora of attacks.\n",
    "personality": "Raymond maintains an amicable and polite demeanor, speaking casually to those whom he interacts with. He is shown to be shrewd and intelligent,  as he specifically chooses Isene as his research site since its community is relatively isolated from most of the world, allowing him to conduct his experiments with little hindrance from the government. He is also quite conceited and amoral as he justifies his inhuman experimentations on the villagers of Isene as contributions to God's will, being utterly remorseless of the cruelty he has inflicted upon the innocent in his pursuit for power. He sincerely believes that his course of action is a sacrifice necessary for the greater good in order to combat the ongoing corruption and other malevolent forces which he believes will inevitably shatter the veil of peace that the world has achieved, leading to another catastrophe much like the Crusades. Once he assimilates Inus and gains his power, he exposes his true megalomaniacal personality, as he perceives himself to be the God to hold the right to judge and eliminate the lives of others that he deems as sinners.\n"
  }
}