{
  "name": {
    "english": "Kliff Undersn",
    "kanji": "クリフ＝アンダーソン",
    "romaji": "Kurifu Andāson"
  },
  "alias": "Dragonkiller",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/6/60/Kliff_Underson.png/revision/latest?cb=20111210045438",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "71 ",
    "height": "148cm/180cm(4'10\"/5'11\")",
    "weight": "55kg(121lbs.)",
    "blood_type": "AB",
    "origin": "Switzerland",
    "birthday": "September 9",
    "eye_color": "Brown",
    "hobbies": "Sailing",
    "likes": "His priceless Japanese teacups",
    "dislikes": "Fashionable, voguish words"
  },
  "description": {
    "info": "Kliff Undersn, alternatively spelled as Andersn, is a playable character in the Guilty Gear series. A formidable warrior active during the Crusades and a member of the Sacred Order of Holy Knights, Kliff was its commander for decades until he retired of old age, being succeeded by Ky Kiske. He is Testament's adoptive father.\n",
    "design": "In his prime, Kliff was a tall man with long light-gray hair and a fierce expression. However, with the years, Kliff lost a lot of his height even as he retained his muscular frame, and changed to a short haircut, beard and bushy eyebrows. Rather inexplicably, whenever he performs an Overdrive, Kliff momentarily returns to his more youthful look.\nHe is invariably seen wearing a sleeveless, non-longcoat variant of the uniform worn by the Sacred Order of Holy Knights. It retains the elbow-length cape, but it is entirely light-brown with silver borders, and has a metal plate in his collarbone area. He also wears dark brown fingerless gloves with metal plates on the backhand, and matching boots.\n",
    "personality": "Kliff during his youth, was often full of zeal and was quite daring in order to see the wars he grew up in come to an end. As he aged, his personality grew somewhat more strict yet still remained tough at heart. Even then, he always stood for fairness and was a kind man. He regarded his men as family and had started to feel great remorse when lives are lost and innocence is tarnished. Kliff feels that he will be condemned for the sins of involving children, like Ky and his own adopted child, in the war against Gears.\nEven though he is conscious of his own age as he grows older, Kliff is an extremely vigorous and stubborn individual, having remained on active duty until his eighties and wanting to impact others to fight against their oppression. While he fights because it is his duty as a knight, Kliff much like in his younger years seems to enjoy a worthy challenge, and is willing to spar with anyone at any given time; even in the post-war years, he would alleviate his own boredom by studying fighting styles.\n"
  }
}