{
  "name": {
    "english": "Kum Haehyun",
    "kanji": "琴 慧弦（クム＝ヘヒョン）",
    "romaji": "Kumu Hehyon"
  },
  "alias": "The Tuner (調律師, Chōritsu-shi?)",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/1/1f/Kum_image.png/revision/latest?cb=20160526180705",
  "profiles": {
    "race": "Human",
    "gender": "Female",
    "age": "Unknown",
    "height": "246cm(8'1\")",
    "weight": "199kg(438.7lbs.)",
    "blood_type": "A",
    "origin": "Korea",
    "birthday": "December 5",
    "eye_color": "Pink",
    "hobbies": "Trimming \"his\" beard, making accessories",
    "likes": "Humanity and justice, the chain that is fitted to \"his\" arm",
    "dislikes": "People who do not do their best"
  },
  "description": {
    "info": "Kum Haehyun is a character in the Guilty Gear series. Haehyun is the fifth and current head of the Kum family, who are known for their great knowledge of Ki energy. Because her family does not allow women to hold positions of power, Haehyun controls a robot with the form of an imposing elderly master.\n",
    "design": "Haehyun is a teenage girl of fair complexion, pink eyes and medium thick brows. Her hair is multi-colored, being mostly dark violet but with white locks on her left side. She wears her hair in a bun tied with a purple lace, while wearing suzu bell-like headphones with \"TESLA\" written on them. Her outfit consists of a white hanbok with a pink ribbon shaped like the infinity symbol, and a purple undivided chima.\nAt all times, Haehyun pilots a robot with the appearance of a heavily-built elderly man. It has long, white hair and beard, and is partially bald. His eyes are equally white and without pupils. It wears a blue hakama with gold details, above a kimono. Only its right sleeve is properly worn so as to show off the left arm's dark orange flame tattoo and a dark grey chain that Haehyun cherishes. A chain with a suzu bell accessory functions as its belt.\n",
    "personality": "At first glance, Haehyun seems to be an extremely serious sort of person, although that may only be because of Jonryoku's rather stern, non-emoting face. What is true is that Haehyun takes her duties in earnest and puts maximum effort with regard to everything, gaining much trust from everyone around her. While her services are costly, Haehyun is able to put that aside when the future of many is in jeopardy, and will pull her life at risk to save them.\nShe displays a dignified demeanor, and has a high standard for people, not caring for those who don't apply themselves fully to a subject. In private Haehyun has also shown a playful side, as seen when she teased May.\n"
  }
}