{
  "name": {
    "english": "Ky Kiske",
    "kanji": "カイ＝キスク",
    "romaji": "Kai Kisuku"
  },
  "alias": [
    "Boy(小僧,Kozō?or坊や,Bōya?)",
    "First/HighKing(第一連王,DaiIchiRen-Ō?)",
    "UselessOriginal(駄目オリジナル,DameOriginaru?)",
    "ThunderKing(迅雷の所以,JinrainoYuen?)",
    "Bambino(バンビーノ,Banbīno?)",
    "MisterKing(連王さま,RenŌ-sama?or王さん,Ō-san?)",
    "BoyGenius(天才君,Tensai-kun?)"
  ],
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/e/e9/Ky_Guilty_Gear_Strive.png/revision/latest?cb=20191119010359",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": [
      "23(GG)",
      "24(GGX—GGXXΛC+R)",
      "27-28(GG2)",
      "29(GGV—GGXrdR)",
      "30(GGXrdR2—)"
    ],
    "height": "178cm(5'11\"or5'10\")",
    "weight": "58kg(128lbs.)",
    "blood_type": "AB",
    "origin": "France",
    "birthday": "November 20",
    "eye_color": "Blue-green",
    "hobbies": "Collecting teacups",
    "likes": [
      "The smiles/happiness of others",
      "His wife and son (GGXrdS—)"
    ],
    "dislikes": [
      "Sol (GG—GG2)",
      "His own weak heart (GGXrdS—)"
    ]
  },
  "description": {
    "info": "Ky Kiske is the deuteragonist of the Guilty Gear series and Sol Badguy's rival. A former member of the Sacred Order of Holy Knights during the Crusades, Ky is a charismatic swordsman who possesses a strong sense of justice and piety, which sustain and guide him through all manner of shaking uncertainties.\nKy has an Awakened form, who is an unlockable boss character in Guilty Gear Isuka only.\n",
    "design": "Ky is a handsome young man with blond hair and blue eyes. His hair has grown in the timeline of the series, to the point where he sports a ponytail in the Xrd games, although he goes back to a short hairstyle in Strive.\nHis classic outfit is a loosely-fitting, blue base version of the white uniform worn by the Sacred Order of Holy Knights that consists of white trousers and shirt below a white longcoat; its knee-length front resembles a blue cross and has a white elbow-length cape. It is fastened together by a belt buckle inscribed with the word \"HOPE\". Ky invariably wears fingerless gloves, either black or blue. In Xrd, he returns to a modified Holy Order uniform, much more form-fitting than before. In casual settings, he is shown to favor collared shirts and trousers, seen in artwork and After Story A.\nIn Overture, he sports instead a elaborate rolled-up longcoat with two big belts as well as a blue cloak, while keeping his color scheme. In Strive, his outfit consists of simple dark blue trousers and dark brown boots, a single-sleeved V-neck dark blue shirt with lapels, a cape-like white jacket over his shoulders, and blue gloves with metal plates on the backhand. Attached to his brown waistbelts is a scabbard wherein he keeps the Thunderseal sheathed. Both his outfits in Xrd and Strive have the phrase \"Nothing can be done without hope\" and the Illyricum symbol throughout.\n",
    "personality": "Ky is a religious man, the adjective describing both his devotion to God, as well as his commitment to the ideals of justice, order, and honor.  Of a straightforward and serious personality,  Ky is kind-hearted,  charismatic,  honest,  diligent, polite, and believes in fair play.  He is also chivalrous, being known to hold back against female opponents, and is utterly dedicated to protecting the weak.  On the other hand, Ky can be notoriously inflexible  and is easily disgusted by those who disturb the peace, having a complex about freedom even if he doesn't realize it.  He is also a \"hot-blooded fool\",  prone to taking rash actions when angered. \nWhile others may mock Ky for his idealism (especially Sol),   he has the determination to live life according to what he believes in.  His dogged pursuit for justice  and fairness  has upset more than a few in power,  as he is willing to confront his superiors if he believes them to be corrupt.  Ky himself knows that his idealistic dreams can never come true,  but he will try regardless for the sake of others he cares for. \nAlthough Ky's strong beliefs once tended to color his moral world black and white,  realizing that his 'justice' was limited to human convenience  and that no single truth governed everything was a significant blow to his identity.  Becoming king prior to Overture also made him lose some of his zeal —his view has since broadened significantly, and has learned to see the world from the perspective of others.  Initially conflicted by the appointment,  the throne made Ky lose the old shine he had as a youth,  but he has since increasingly defied conventions, being the \"problem child\" according to Leo. \nKy is firmly committed to the public good and to bringing hope to others,  and treasures peace above all.  However, he was forged by war; such that Justice once remarked that Ky had the \"eyes of someone who knew nothing yet but battle\".  Once a merciless enemy  to all Gears, he actively wishes to move on from the \"killing machine\" that he was during the Crusades,  and leave his hatred behind.  Although Ky's skills remain as sharp as back then, his sense of honor prevents him from using war-time tactics in duels.  Is it also due to such a change in his personality these days, his iconic rivalry with Sol was softened to where Ky himself reflected on the lofty aspects of it. \n"
  }
}