{
  "name": {
    "english": "Leo Whitefang",
    "kanji": "レオ＝ホワイトファング",
    "romaji": "Reo Howaitofangu"
  },
  "alias": [
    "SecondKing(第二連王,DaiNiRen-ō?)",
    "LionoftheTwoSwords(双剣の獅子,FutakennoShishi?)"
  ],
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/8/87/Leo_Guilty_Gear_Strive.png/revision/latest?cb=20220322051424",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "Unknown",
    "height": "196cm(6'5\")",
    "weight": "83kg(183lbs.)",
    "blood_type": "A",
    "origin": "Germany",
    "birthday": "July 1",
    "eye_color": "Blue",
    "hobbies": "Editing his own personal dictionary",
    "likes": "Records, his own pride",
    "dislikes": "Pickles, those more capable than he is"
  },
  "description": {
    "info": "Leo Whitefang is a major character in the Guilty Gear series. Leo is one of the Three Kings of the United Kingdoms of Illyria, governing over twenty nations in the European and Asian regions of Illyria. Also an accomplished warrior in his own right, he shares a friendly rivalry with Ky Kiske.\n",
    "design": "Leo is a very tall and somewhat rugged-looking man with shoulder-length, unkempt blond hair, a beard, and blue eyes. The jacket he wears is much more sophisticated than his fellow Kings' outfits as an orange, fur-laced coat bearing several belts and crosses. Each leg of his pants also has a cross to match the jacket. He also wears black fingerless gloves. \"Noblesse oblige\" and \"Ignorance may kill a lion\" are written throughout his outfit and weapons.\nHis Strive design gives him a far more down-to-earth look by changing his color scheme from orange and black to brown. He now wears a simple white open-collared shirt below a black double-breasted waistcoat with rectangular lapels, as well as light-brown flannel trousers. His brown trenchcoat still keeps the light orange fur collar—yet no longer cape-like as before—and fur cuffs.\n",
    "personality": "Leo has a rather boisterous attitude, and is constantly and overwhelmingly intimidating.  He can be extremely loud whenever caught off-guard,   but in reality, he is an exceptionally cautious person  who spares no effort when solving problems,  and is serious and level-headed whenever a situation demands it.   \nAt the same time, Leo has far more pride than the average man, and hates losing above all.  Leo's pride appears to be a result of his great fighting aptitude, but in his youth it also made him \"self-centered\" and ready to disregard anybody—which was everyone—he thought was inferior. Meeting Ky humbled Leo, and led him to try and improve himself.  While Leo still holds himself in high esteem,  and is not shy to praise his own skill when victorious, he is not necessarily arrogant: he is a much harsher critic of himself than he is of anyone else,  and if he had to grade himself, he would probably say \"C-\".  In turn, he seems to have developed something of an inferiority complex towards Ky, even if he completely trusts him.  \nLeo is in the process of building his own personal dictionary, a copy of The Royal Illyrian Dictionary, and tends to redefine words as he sees fit,  with actual people and events.  For example, he has written his sister's name in the section for \"devil.\" \n"
  }
}