{
  "name": {
    "english": "Leopaldon",
    "kanji": "レオパルドン",
    "romaji": "Reoparudon"
  },
  "alias": null,
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/1/15/Loepaldon.png/revision/latest?cb=20111018030457",
  "profiles": {
    "race": "Gear",
    "gender": "Unknown",
    "age": "Unknown",
    "height": "",
    "weight": "",
    "blood_type": "",
    "origin": "",
    "birthday": "",
    "eye_color": "",
    "hobbies": "",
    "likes": "",
    "dislikes": ""
  },
  "description": {
    "info": "Leopaldon is a mysterious character that has only appeared in Guilty Gear Isuka as the boss of the game's Arcade Mode. It's an entity composed of a dog fused with an ancient Gear and controlled by the dog's owner, a drum-beating sorcerer. It's unclear whom the name belongs to, but it most likely refers to either the dog, the Gear, or both.\n",
    "design": "The Gear is a massive, white-scaled creature with red eyes, muscular limbs, and brown fur that covers its hands and nether regions (with a tuft of fur sticking out its backside, which acts as its tail). It sports black tattoos on its shoulders, tan bandages around its forearms, and black open-toed boots on its feet. Its massive mouth is full of big yellow teeth and brown threads connecting its gums to its lips. As the sorcerer and his dog reside within the Gear's mouth, the Gear keeps its mouth perpetually open wide. The only time it's shown with its mouth not like this is in its introduction animation, where it pops out of a pile of snow shaped like a Greek head bust. \nThe sorcerer's pet is a brown-furred, black-nosed dog. On its head is a piece of black headwear reminiscent of a gimp mask. On the parts of the headwear where the eyeholes would be are two red ornaments that look like ball gags. Since it's fused with the Gear, its head is the only part of its body that's seen most of the time. The only time its full body is shown is in Leopaldon's win animation, where the Gear kneels and the dog momentarily defuses with it to pant.\nThe sorcerer is a red-eyed humanoid clad in black armor that perpetually beats on a big brown drum.\n",
    "personality": "The Gear has no personality, being a corpse the dog fused with and the sorcerer keeps perpetually animated. Because of this, it merely serves as the \"body\" of Leopaldon. It's only real characteristic is its ability to cause destruction on a massive scale, just like its fellow Gears. \nThe dog bears little more than the usual characteristics a common dog has. It is, however, the \"mind\" of Leopaldon, as it's fused with the Gear and the way the Gear moves hint the dog's using the Gear's body as its own. Because of this, it's likely the character the player's actually fighting—and the one that actually bears the name \"Leopaldon\"—is the dog. The fact Leopaldon's in-game portrait often closes in on the dog further supports this theory.\nAll that's known about the sorcerer is he's a good man always trying to do the right thing, using the Gear's powers to help those in need. It's unknown why he perpetually beats on a drum, but since he's Leopaldon's \"pilot\", it's likely how he keeps the Gear animated.\n"
  }
}