{
  "name": {
    "english": "May",
    "kanji": "メイ",
    "romaji": "Mei"
  },
  "alias": [
    "LittlePrincess(お姫様,Ohime-sama?)",
    "CuteLittlePirateLady(可愛い船長さん,KawaiiSenchou-san?)",
    "Shorty/Kid(チビ,Chibi?)"
  ],
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/d/d7/May_Guilty_Gear_Strive.png/revision/latest?cb=20191119010453",
  "profiles": {
    "race": "Human",
    "gender": "Female",
    "age": "Unknown",
    "height": "158cm(5'2\")",
    "weight": [
      "42 kg  (93 lbs.)  (GG)",
      "47 kg  (104 lbs.)  (GGX—GGXXΛC+R)",
      "49 kg  (108 lbs.)  (GGXrdS—)"
    ],
    "blood_type": "B",
    "origin": "Unknown (Japan)",
    "birthday": "May 5 (the day she was found)",
    "eye_color": "Black",
    "hobbies": "Thinking about Johnny",
    "likes": "Johnny",
    "dislikes": "Bald people"
  },
  "description": {
    "info": "May is a recurring character in the Guilty Gear series. She is the young-looking and spunky first mate of the Jellyfish Pirates and is utterly dedicated to Johnny, her captain and the man who raised her after she was orphaned.\n",
    "design": "May is portrayed in the games as a young girl with brown eyes and waist-length hair, usually tied in a ponytail. Despite the series' chronology spanning seven years, she seems to never age.\nHer usual outfit consists of an orange coat, with a skin tight body suit underneath, and big orange boots. She wears an orange pirate tricorn hat and fingerless gloves with silver plating over them. She is seen easily carrying a ship's anchor of about her own size. In the Xrd games, May's waist cape loses the cloth in the front, and her tights are replaced with orange pants. The rest of her design remains relatively the same.\nIn Strive, she maintains her fingerless gloves, boots as well as her trademark orange pirate hat, but she now wears an orange hooded sweatshirt and black lycra shorts, and carries a beige Chimaki-themed backpack.\n",
    "personality": "May is cheerful and openhearted,  but also childish in her way of thinking.  Being something of a plucky girl, May uses the pronoun 僕 (boku?), primarily used by boys and young men. Per her own words, all she does is enjoy the simple life with her friends,  and her motivations are rather simple: they revolve around protecting her family,  the Jellyfish Pirates—going so far as to part ways with them if that means their safety, no matter how much she wants to be with them —, and getting Johnny's attention. \nFor her captain and savior, May has an intense and abiding love,  usually measuring the value of things in relation to Johnny,  and often boasts that if it came down to Johnny or the world, she would choose Johnny every time. She is anxious to become a woman so that he might notice her, but so far has met with little success on that front. \nA spunky  and energetic  soul, May likes pranks,  and never sweats the small stuff. She believes in taking action first, and thinking later,  and oftens drags her friends along with her impulsive behavior.  At the same time, her positivity is infectious, and no one can be around her for long without feeling buoyed by her enthusiasm,  even if it sometimes gets to the point it becomes exhausting.  May also has an irrational fear of bald people or peladophobia, and can sense them from a distance. Because of this, she is wary of Faust,  although she does trust his medical expertise.\n"
  }
}