{
  "name": {
    "english": "Millia Rage",
    "kanji": "ミリア＝レイジ",
    "romaji": "Miria Reiji"
  },
  "alias": "The Blonde Huntress (金髪の女豹, Kinpatsu no Mehyō?)",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/e/e0/Millia_Guilty_Gear_Strive.png/revision/latest?cb=20220322053632",
  "profiles": {
    "race": "Human",
    "gender": "Female",
    "age": "Unknown",
    "height": "169cm(5'7\")",
    "weight": "48kg(106lbs.)",
    "blood_type": "B",
    "origin": "Russia",
    "birthday": "Unknown (is an orphan)",
    "eye_color": "Blue",
    "hobbies": "Chasing cats",
    "likes": [
      "Chastity (GG—GGXrdR2)",
      "Her current life (GGST)"
    ],
    "dislikes": [
      "Zato (GG—GGXXΛC+R)",
      "Losing hair in battle"
    ]
  },
  "description": {
    "info": "Millia Rage is a recurring character in the Guilty Gear series. A former member of the Assassin's Guild, she fights with the skills of her old occupation in search of a better life. Wielding her cursed hair as a weapon, she is able to give it any shape and form that she desires.\n",
    "design": "Millia has long flowing blonde hair and blue eyes with dark eyelashes. Millia's hair in her in-game stance is seen tied in a ponytail, but given its properties, it changes shape frequently, from cut short to very lengthy, and can take any shape, even that of decorative flowers.\nMillia's classic outfit consists of a white blouse with light blue hemlines and a collar that covers the whole of her neck; there are also two straps that run across her collar bone right above her chest. She also wears a leotard under her blouse, padded arms, whole length gloves, and a light blue headband across her forehead and her legs are also bare.\nIn Xrd, Millia's design has drastically changed, as she now wears a yellow blouse with black hemlines, complete with a matching pillbox hat that has a sign saying \"zl-28\" and \"13\", black leggings, white fingerless gloves and peach colored ballet shoes.\nIn Strive, she now wears a short trench coat, with a light orange shawl over her shoulders and a fur hat with the Xrd sign attached to it. She wears a P.W.A.B. armband on her left arm, black gloves and a new shade of leggings with black knee-highs boots.\n",
    "personality": "Millia is elegant and feminine, but does not hesitate to fight when necessary. Cold and somewhat silent,  she was molded by years of assassin conditioning,  with an upbringing apparently bereft of much affection.  Of serene reactions that show little interest in anything, Millia doesn't feel at disadvantage for being a woman, and makes decisions solely on the basis of cost and benefit.  Yet under her cold exterior, she has not completely lost her humanity;  she is compassionate, especially to children—she cannot bring herself to harm them —, and believes the life of an assassin to be loathsome.  \nPerhaps because of her complex relationship with Zato—her savior, teacher, lover,  and enemy —, Millia seems to hold men in low regard, thinking them to be selfish,  and is not afraid to voice her biting opinions of them.   As for her decision to leave the Guild  (which, no matter what, she sees as her home ), Millia chose to do so after a greal deal of thinking, as she didn't want to \"keep hating what she hated\", and the only way out was betraying Zato.  No matter her feelings for him, Millia prioritizes her own will above all,   and wishes to find happiness. Settling her past, however, has led her to obsession at times.  \nAfter leaving the Guild  and living among ordinary people,  Millia remains a lonely individual,  but she has learned to tap into a wider range of human emotion, making her more considerate of others, and more compassionate.  She also makes sure the danger that follows her does not spread to others.  When faced with a situations she doesn't know how to handle, she will act more like a child than her usual self. \n"
  }
}