{
  "name": {
    "english": "Ramlethal Valentine",
    "kanji": "ラムレザル＝ヴァレンタイン",
    "romaji": "Ramurezaru Varentain"
  },
  "alias": "Ram (ラム, Ramu?)",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/c/c2/Ramlethal_Guilty_Gear_Strive.png/revision/latest?cb=20220322052033",
  "profiles": {
    "race": "Valentine",
    "gender": "Female",
    "age": "Unknown",
    "height": "167cm(5'6\")",
    "weight": "52kg(115lbs.)",
    "blood_type": "Unknown",
    "origin": "Backyard",
    "birthday": "June 3",
    "eye_color": "Amber",
    "hobbies": [
      "None (GGXrdS—GGXrdR2)",
      "Pondering about the meaning of things (GGST)"
    ],
    "likes": [
      "None (GGXrdS—GGXrdR2)",
      "Almost everything (GGST)"
    ],
    "dislikes": "Arthropods"
  },
  "description": {
    "info": "Ramlethal Valentine, also spelled as Ramletherl, is a major character in the Guilty Gear series. A servant of the Universal Will and Elphelt Valentine's older sister, and successor to the first-generation Valentine, Ramlethal's objective is the destruction of humanity. She is accompanied by Lucifero, split into white and black halves, who carries katana-styled greatswords on her behalf.\n",
    "design": "Ramlethal has a dark-skinned complexion, white hair, and golden eyes with bronze highlights. Her outfit in battle is comprised of a black and white cap styled after a pair of animal ears, and a large white cape with shoulder pads and holes for her arms to pass through. This cape seems to possess an organic nature: the underside is flesh-like, and its edge possesses retractable saw-like teeth. Underneath the cape, she wears the minimum article of clothing, which comprises of white shorts, a broad white strap with round buckle worn as a tube top, and smaller versions of the aforementioned straps on her thighs and arms.\nIn Strive, her attire has been altered slightly from the Xrd games. While her shorts are unchanged, she now wears a sleeveless, black and neon green shirt below a white, double-breasted waistcoat that only shows her midriff. She also wears a brand new cap with shortened ears. Continuing from the incident at Scandiva, she wears wraps on her arm and leg, which are now dark red.\nRamlethal has a secondary outfit, in which she wears a blouse with puffy sleeves with ribbons on her collar and lower back, a short folded skirt, and her white straps on her thighs with no footwear. The ensemble is dark gray, dark green, and white in color.\n",
    "personality": "As a Valentine, Ramlethal is devoid of emotions, having no conscience of her own. She doesn't grasp the concepts of right or wrong, like or dislike,  and is unable to place any kind of value on anything other than her assigned target.  She views the orders of her \"Mother\" as absolute, having a machine-like determination to see her mission completed.  Unquestioning of her mother's directives, she views herself as a obedient \"tool\" to be used to achieve a goal,  and believes herself to be disposable once she achieves her mission. \nBut like other Backyard life-forms, she inevitably starts learning emotions as she goes along.  Ramlethal begins to become \"unstable\", showing confusion at Elphelt's rebellion,  pride as a tool for her mother,  and fondness for her magehound.  Since tools don't need emotions, she denies having them,  for her mother \"only loves useful tools\",  which Sin interpreted as her being afraid of being abandoned if she didn't act like an emotionless machine.  Yet, Ramlethal starts wondering about concepts like friendship, being \"unique\", others' motivations,  what it feels to like someone,  and happiness. \nHer interactions with others lead Ramlethal to conclude that she nor Elphelt are tools, that emotions are important, and that her sister and Sin are \"unique\" to her.  Even so, Ramlethal emotes little—having deadpan reactions to either pain or the antics of others—, and remains a rather quiet person.  Nevertheless, she is bothered by others being treated coldly as \"dolls\", or tools. \n"
  }
}