{
  "name": {
    "english": "Raven",
    "kanji": "レイヴン",
    "romaji": "Reivun"
  },
  "alias": [
    "TheWatcher(監視者,Kanshi-sha?)",
    "TheUndyingDisease(不死の病,FushinoYamai?)"
  ],
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/6/60/Raven_-_Revelator.png/revision/latest?cb=20160710234609",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "Unknown (doesn't remember) ",
    "height": "181cm(5'11\")",
    "weight": "59kg(130lbs.)",
    "blood_type": "A",
    "origin": "Medieval Germany",
    "birthday": "March 28",
    "eye_color": "Green",
    "hobbies": "Unknown",
    "likes": "Anyone who can make him feel threatened, new discoveries, inventors",
    "dislikes": "Being unable to love"
  },
  "description": {
    "info": "Raven is a recurring character in the Guilty Gear series. He is one of three servants of That Man, and his right-hand man. With an immortal body that cannot die of natural causes, Raven has lived about a thousand years, and nothing stimulates him anymore, except pain.\n",
    "design": "Raven's most defining trait is the silver-colored metal spike driven through his head, which protrudes from his forehead like a horn.\nIn XX, Raven's skin is a light cold blue, and his long, waist-lenght hair a medium gray. A ragged vertical scar runs across the right side of his face and eye, which emanates a silver light, and a series of small needle piercings run parallel to the scar. He wears a black body suit with a bird-shaped breastplate and long boots. His shoulders, forearms, and calves are pierced with long needles, and his forearms are loosely wrapped in bandages.\nPrior to Overture, his skin fades into a more natural pale white hue and his—now shoulder-length—hair fades into white. His right eye is no longer damaged, but the pupil of his left eye is replaced with a golden coin. He dons a black wing-shaped cloak with a collar that resembles feathers; when closed, it covers his entire body. Its back bears the kanji 鴉 (karasu?, lit. crow), and his chest, a green bird emblem. Beneath the mantle he wears a black body suit, and a kilt with hanging leather straps. Raven wears an mask with a cross-shaped visor and a golden coin on its left side, as well as rings with long needles affixed to them on the index and middle fingers of both hands.\nIn Revelator, with his face now entirely visible, Raven retains his needle rings and black wing-shaped mantle, but it now has a hood with six white protrusions instead, and his shoulders are draped with water green straps with cross-shaped silver buckles. A silver wing design is emblazoned on the back of the mantle. Beneath, he wears a black V-shaped sleeveless vest with crisscrossed white bands, and black pants with baggy chaps attached to his waist with oversized buckles.\n",
    "personality": "Raven has a mature personality,  being stern  but also calm and level-headed,  that others can calmly communicate with because he isn't swayed by emotions. Although he has good intentions,  Raven has grown incredibly jaded with the world,  and has lost interest in life,  having forgotten what it is like to be a normal \"human\".  Even so, he remains capable of gentleness and empathy.  Why he fights for That Man is a mystery,  but he agrees with his actions,  and his loyalty is absolute.  It seems that, in his immortal life overriden by boredom, That Man was able to inspire Raven and offer new stimulation, for which he is extremely grateful. \nAfter living for close to a thousand years, in a constant state of perpetual life, Raven can no longer be moved by any of his five senses.  In fact, being in agony  and pain have become his only source of pleasure. An unapologetic masochist, the closer Raven comes to death, the more he feels alive,  for which he relishes imminent pain with anticipation.\n"
  }
}