{
  "name": {
    "english": "Robo-Ky",
    "kanji": "ロボカイ",
    "romaji": "Robo Kai"
  },
  "alias": null,
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/5/56/Robo-Ky.png/revision/latest?cb=20111210180011",
  "profiles": {
    "race": "Robot",
    "gender": "Male programming",
    "age": "Unknown",
    "height": "Unknown",
    "weight": "Unknown",
    "blood_type": "Unknown",
    "origin": "Unknown",
    "birthday": "Unknown",
    "eye_color": "Yellow",
    "hobbies": "Unknown",
    "likes": "Unknown",
    "dislikes": "Unknown"
  },
  "description": {
    "info": "Robo-Ky is the name used by the many robotic copies of Ky Kiske, thus referring to several characters in the Guilty Gear series. The first, original model of Robo-Ky appears in Guilty Gear X Plus. This imitation series army was created by the Post-War Administration Bureau, who deploy them against anyone they consider a threat or as an asset to their goals.\nAn upgraded model, a mass-produced version of the original Robo-Ky, appears as a playable character in Guilty Gear Isuka.\n",
    "design": "All Robo-Ky models wear the Sacred Order of Holy Knights uniform that Ky Kiske himself wears only in a different shade and without the fingerless gloves. As of #Reload, the word \"ENNUI\" is etched onto their belt buckle in the place of Ky's \"HOPE\". In Guilty Gear X Plus, Robo-Ky's sprite during Ky's Story Mode path is simply a palette swap of Ky's (as he is merely an alternate \"GG Mode\" playable version of Ky in this game), always showing up with an almost-white light-green uniform with dark mauve hems, electric blue instead of blue, and orange hair.\nAll Robo-Kys have a metallic face with nails and bolts. Their rectangular mouths, with a white teeth-like plating, have visible joint lines, while their eyes are bright yellow lenses. Sporting the same blond hairstyle as Ky, they have winding keys like those of a wind-up toy on the side of their head (which so far only appear in artwork and not the sprites).\nThe most notable difference between the original model and posterior versions is their \"skin\" (or more accurately, plating) color. The first Robo-Ky had Ky's fair skin color, while subsequent models are colored light-turquoise, and later grey green. In Guilty Gear XX, several characters mistake Robo-Ky with Ky, but by Λ Core Plus, all characters are clearly able to tell he is a robot. On his chest underneath his clothing, is a Hercules beetle emblem (also seen on a switch that can be revealed on their ankles) that seems to be the primary engine they run on, the Hercules Engine.\n",
    "personality": "The original Robo-Ky from X Plus was shown to have a grudge against the normal Ky, stating that defeating the original was a reason for its existence. Rather persistent, his slouching stance and crawl seem to hint at number of bugs. Later units (such as the one Λ Core Plus) also believe that proving their superiority to the original is a matter of identity and pride.\nIn XX, the many Robo-Kys begin to show many defects in their personality, turning into self-centered, egotistical robots that sees humans as inferior creatures, even as they demonstrate extremely human behavior.  They claim to be loyal to the Post-War Administration Bureau, while mocking and looking down upon the other characters and proving to them the \"might, order and superiority\" of the P.W.A.B. As of ♯Reload, in its gameplay and in-battle quotes, Robo-Ky gains somewhat of a more comical personality, which is expanded upon and canonized in Λ Core Plus.\nThe Robo-Ky shown in Story Mode of Λ Core Plus is a perverted, womanizing, sleazy, and for all intents and purposes defective model. \"Ennui\" is etched onto his belt, which suggests he may be acting out of boredom. He is both an archaic model and a \"fake\", meaning he is not registered. Likewise, he often refers to himself by the Japanese pronoun of \"washi\" (a self-referring pronoun commonly used by elderly men). It pretends to obey its creator and (technically) master, but in fact does the opposite.  \nHe openly appreciates \"sexy\" women like Jam, Dizzy and Baiken while also being quite perverted and petty in several of his in-battle quotes (with some being a play on his original). A common tic of his is calling humans \"no good/defective\", most of which is directed towards his opponent and his creator, Crow.\nThe last remaining Robo-Ky unit in Xrd differs greatly from prior iterations. While loud-mouthed and somewhat in the slumps, he has nonetheless gained much insight and newfound ideals that make him radically different from his peers, despite some comical traits still being prevalent. He is able to see through Bedman's wicked farce while stating that \"despite so many complicated ideologies people don't need, they can still connect\" while also expressing a sense of gratefulness to society, and is shown to encourage Venom to care more about himself. He is something of a romanticist, firmly believing in the importance of \"dreams\" and having one of his own.\n"
  }
}