{
  "name": {
    "english": "Sin Kiske",
    "kanji": "シン=キスク",
    "romaji": "Shin Kisuku"
  },
  "alias": null,
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/d/d7/Sin_Kiske_Strive.png/revision/latest?cb=20221122074425",
  "profiles": {
    "race": "Quarter-Gear/Human hybrid",
    "gender": "Male",
    "age": [
      "3-4(GG2)",
      "5(GGV—)"
    ],
    "height": "181cm(5'11\")",
    "weight": "73kg(160lbs.)",
    "blood_type": "Unanalyzable",
    "origin": "Illyria",
    "birthday": "May 31",
    "eye_color": "Emeraldgreen",
    "hobbies": "Searching for novel adjectives, overcoming his dislikes one at a time",
    "likes": "His mother, his raging appetite, he can't say the last one",
    "dislikes": "People who aren't willing to overcome their dislikes, being treated like a child"
  },
  "description": {
    "info": "Sin Kiske is one of the main characters of the Guilty Gear series. He is the son of Ky Kiske and Dizzy, inheriting her Gear blood and great power. A carefree young man, Sin was raised by Sol Badguy, alongside whom he works as a bounty hunter.\n",
    "design": "Sin, much like his father, is a young man with blue-green eyes and disheveled blonde hair. Unlike Ky, however, Sin is a little bit taller and has much more muscle mass.\nHis outfit consists of a white jacket with blue and brownish trimming, and a white and blue undershirt connected by a strap. He wears a brown colored eye patch over his right eye, and a golden cross necklace around his neck. Sin's design also contains white gloves on each of his hands, white trousers with two golden loops hanging from each legging, a blue and blackish sash around the waist of his trousers, and brown shoes. His gloves and flag say \"OATH\" while his eyepatch has the phrase \"Be a light onto yourself\".\n",
    "personality": "Sin has a happy-go-lucky and optimistic disposition, and while he isn't the most well-spoken and can be cocky at times, he has a big heart and tries to improve his shortcomings one at a time. He feels uncomfortable in orderly situations and is not too good at social dispositions. While his personality that doesn't look back on what's done may seem insensitive, his simple and innocent personality can be refreshing.\nSin appears to have a very deep love for his mother, and trusts Sol Badguy (whom he calls \"old man\") and looks up to him as a father figure and a mentor. Sin, however, does not seem to get along with his father very well, and would rather call him a \"shitty king\". Even so, Sin worries about Ky's safety despite claiming otherwise. Sin begins to slowly warm up to his father after seeing him in action, coupled with Ky's apology. It is only after Sin sees Dizzy again, safe and freed from her sealed state, that he finally reconciles with Ky and calls him \"Dad\".\n"
  }
}
