{
  "name": {
    "english": "Slayer",
    "kanji": "スレイヤー",
    "romaji": "Sureiyā"
  },
  "alias": [
    "Founder",
    "EripmavsDYraid"
  ],
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/3/3a/Sly_image_rev.png/revision/latest?cb=20200515132138",
  "profiles": {
    "race": "Nightwalker",
    "gender": "Male",
    "age": "Unknown",
    "height": "185cm(6'1\")",
    "weight": "70kg(154lbs.)",
    "blood_type": "Unanalyzable",
    "origin": "Transylvania",
    "birthday": "October 31",
    "eye_color": "Brown",
    "hobbies": "Haiku, poetry, observing humans",
    "likes": "His wife, romance , dandyism",
    "dislikes": "Unromantic humans"
  },
  "description": {
    "info": "Slayer is a recurring character in the Guilty Gear series. A charming and refined vampiric gentleman, Slayer is an extremely powerful fighter who enjoys \"meddling\" in others' affairs, often offering advice to the other characters, much to their frustration.\n",
    "design": "Slayer has the appearance of a middle-aged man, to whom class is quite important. Slayer's attire reflects his refined nature: he wears a white undershirt beneath a rather professional-looking gray suit. The sleeves of his coat bear red-cross shaped emblems, a reference to his vampire nature. Slayer has brown hair, usually slicked to the side, complemented by a short well-kept beard and a thin moustache. He wears a monocle, and is often found smoking a pipe. Over his shoulder is an almost magical red cape, that of which can shape-shift, allow for teleportation and often times it's seen to have a mind of its own. In combat, he uses no weapon, relying on his own physical strength.\n",
    "personality": "Slayer is often portrayed as a character who understands a great deal more than other members of the cast. Having lived much longer, he possesses a strengthened sense of perspective, and as such, he generally remains calm and dignified regardless of the situation in which he finds himself. He also often openly shows his practice in dandyism, an old-fashioned lifestyle of high importance and upmost respect to class. In fact, several of his special moves are named after this practice.\nDespite this, he is not without passion. Slayer is a lover of refined things; poetry, romance, and often stops to admire the beauty he sees in the world of Guilty Gear, and in those younger than himself. In combat, his blood boils, and although he is occasionally frustrated by the lack of challenge others are capable of presenting him with, he is ever graceful to those with whom he fights, offering them congratulations for a good performance.\nAs a result of the sentiment he gained from being in the human realm for so long and his unlikely relationships with various characters, he usually assists them with a warning or a bit of advice, despite how he feels someone of his standing shouldn't be focused on such affairs.\nSlayer as a character often fits the ideal image of the classic vampire persona inspired most especially by that of Count Dracula. He acts kind and chivalrous, almost like a mentor to his enemies despite being out to end them, he's always seen in pristine Victorian-era clothing with a red cape over his shoulder while living in an all too familiar European castle; the inspiration drawn from classic vampire stories is obvious.\n"
  }
}