{
  "name": {
    "english": "Testament",
    "kanji": "テスタメント",
    "romaji": "Tesutamento"
  },
  "alias": [
    "Kliff(クリフ,Kurifu?)",
    "GrimReaper(死神君,Shinigami-kun?)"
  ],
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/7/76/Testament_Guilty_Gear_Strive.png/revision/latest?cb=20220322025538",
  "profiles": {
    "race": "Gear",
    "gender": "Non-binary",
    "age": "Unknown",
    "height": "185cm(6'1\")",
    "weight": "73kg(161lbs.)",
    "blood_type": "Unanalyzable",
    "origin": "Switzerland",
    "birthday": "May 9",
    "eye_color": "Red",
    "hobbies": [
      "Slaughter, playing with children (GG)",
      "Thinking (GGX—GGXXAC+R)",
      "Fashion magazines, DIY, collecting makeup, plastic modeling (esp. giant robots), sightseeing, fishing, pottery, river trekking, road biking, appreciating opera, weight training, fortune-telling, bonsai, gardening, watching wrestling, baking, mahjong, painting (not well), embroidery, mountain climbing, nail art, golfing, star-gazing, touring hot springs, board games, writing sci-fi novels, barbecue, belly dance, beach volleyball, watching baseball, making dollhouses, liquor (they're a non-drinker), snowboarding, watching shark B-movies, collecting occult trinkets, scrapbooks (GGST)"
    ],
    "likes": [
      "Their father, potatoes",
      "Themself, their family, their familiars (GGST)"
    ],
    "dislikes": [
      "Saito-style martial arts",
      "Memories (GG)",
      "Sol (GGX—GGXXAC+R)"
    ]
  },
  "description": {
    "info": "Testament is a recurring character in the Guilty Gear series. A humanoid-type Gear that once was under Justice's control during the Crusades, Testament is the adopted child of Kliff Undersn. Able to wield blood magic and a crimson scythe in battle, Testament fights alongside their familiars, Succubus and EXE Beast.\n",
    "design": "Testament has a pale complexion, red eyes, as well as straight, thigh-length black hair. Across most of their appearances, they exclusively dress in black (or dark violet, as seen in their Λ Core artwork) clothes: they wear a midriff-baring top with a mantle covering their arms, and a mid-calf wrap skirt connected by two belts, and secured by another at the waist. They have an arm warmer on one arm and a fingerless glove on the other, as well as a choker with silver studs and a pair of knee-high boots.\nIn Strive, their redesign retains the overall idea, but changes the top for a sleeveless white shirt and frilled cravat, below a black waistcoat with silver buttons on the front flaps, connected to the black mantle over their forearms. The skirt now has buttons and a number of brown waistbelts with skull adornments. Retaining the black boots and arm warmer, they now wear fingerless gloves on both hands: a white one on the right, and black on the left. Testament now also wears a black top hat, with a skull on the band.\nTestament wields a scythe in battle. In Guilty Gear, it had a silver blade and was held with the blade facing down, near their right leg. For the rest of the series, it is crimson red and is wielded with the blade level to their head.\n",
    "personality": "Prior to their Gear conversion, Testament was a diligent and curious individual who abhored violence. Especially fond of children, Testament had a philantropic side: they'd try to provide shelter for those who have lost their homes, and preferred to find ways to reform and educate those who fell from the righteous path rather than blame and condemn them for their crimes. \nKind and gentle,  Testament was a noble soul who placed the needs of others before their own,  wanted to protect the innocent—remembering their oath as a knight even decades later—,  and dutifully wished to repay Kliff for his kindness.   Yet, the forced conversion caused Testament to become extremely distrustful of humans and cynical.    The annihilation of mankind,  however, is not something they truly desire. Kliff attributed such madness to whatever Testament saw during the war, all the bloodshed,  but it was a command forcibly planted by Justice. Because Testament had a strong will,  emotional fortitude,  and great love for Kliff,  they were semi-independent  from her orders, retaining their consciousness and memory but unable to disobey. \nAfter Justice's death, Testament regains their true self but is tormented by the horrific things they had done under her control. Choosing to isolate themself from humanity,  Testament latches onto the idea of protecting the innocent Dizzy, and later the Forest of Demons, as a new purpose in life.  Feeling guilty, this is a way to atone for their sins, but by Strive it ends up bringing back Testament's human sensibility.  Despite their distrust, Testament is often reluctant to fight humans—resorting to verbal intimidation first—even as they affirm that killing men is a Gear's personality,  and feels a certain kinship with fellow victims as \"friends of war\".   Eventually, watching over Dizzy's \"parents\"  has brought Testament peace of mind,  and they no longer look on humans with hostility. \n"
  }
}