{
  "name": {
    "english": "Zappa",
    "kanji": "ザッパ",
    "romaji": "Zappa"
  },
  "alias": "Team Rubbish/Team Bottom of the Barrel (ボンコツチーム, Bonkotsu Chīmu?)  (with Randy)",
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/e/ea/Zappa.png/revision/latest?cb=20200515132453",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "Unknown",
    "height": "180cm(5'11\")",
    "weight": "66kg(146lbs.)",
    "blood_type": "A",
    "origin": "Australia",
    "birthday": "June 15",
    "eye_color": "Blue",
    "hobbies": "Finding a mate, keeping a diary",
    "likes": "Good health charms",
    "dislikes": "Insects, crabs, anything scary"
  },
  "description": {
    "info": "Zappa is a recurring character in the Guilty Gear series. He is a very unlucky man afflicted by what he thinks is an unknown \"disease\", but in truth, a number of spirits inhabit his body and can control his movements at will, including the violent S-Ko and the powerful Raoh.\n",
    "design": "Zappa is a young man of muscular build, with blue eyes and brown hair that covers his ears in a style reminiscent of a bobcut. In XX, he wears golden hoop earrings and a thin gold headband with a pink heart attached to it, while in Xrd, he drops the earrings and now wears a black and white cap, with a chinstrap and a golden heart-shaped accessory on the left side that has \"Flucht In Den Norden\" etched on it.\nHis main attire during his playable appearances comprises of a white, skin-tight shirt that entirely covers his hands, almost resembling black gloves, and which has a pink heart on the chest. On his writs, he wears golden hoops. Above the white shirt, his dark underpants can be seen. Rectangular pieces of orange cloth are held up by belts to each side of his low-cut, knee-length beige cargo pants. Beneath, he appears to have dark stockings. Zappa's shoes are prominently white, with an orange heel and black soles.\nIn Xrd, Zappa's attire is drastically altered. Besides the aforementioned hat, he wears an Illyrian-styled uniform, comprised of dark brown jacket with white hemlines, buttons, cuffs, and a rectangular piece to the front of his high collar; the black tie hanging from it has a heart-shaped clip-on. Once again his undergarments can be seen below flared dark pants, but now to their side are two black bags big enough to put research documents inside. Both have a orange running man figure as well as silver magnet clasps with \"Exit\" inscribed on them. The stockings are now light gray, while his ankle boots almost entirely black. He no longer wears hoop bracelets.\n",
    "personality": "Described as just a typical Joe who sadly happens to be possessed by evil spirits,  Zappa is by and large a normal young man; apart from timidity, there is little to distinguish him.  He is rather polite,   greatly respects his mother, calling her 母上様 (hahaue-sama?),  and seeks companionship, hoping to find a wife.  Something of a romantic, Zappa once chides Randy for getting excited over every cute girl he sees, finding a show of how much a given girl loves him more appealing. \nHowever, something about Zappa that causes him to attract spirits,  most of whom seem protective of him.  Likely as a product of his possession by these ghosts, Zappa often blurts things during battle, although what he says often doesn't make any sense,  and is quickly interrupted by S-Ko, making him utter curses and shrieks, especially against men due to her grudge.   Suffering under her curse has made Zappa mentally unstable and damaged him physically as well, the numerous injuries and amnesia making him fear for his life and causing him to despair. \nEnduring her possession for years,  Zappa has shown great resolve and self-sufficiency, first going to great lengths to find the extremely elusive Faust, and later to research all there is to the occult  and the physics behind them.  By Xrd, becoming a \"spiritual phenomena nerd\"  and discovering his purpose  has given Zappa a boost in confident  and turned him into a believer of self-actualization (advising Randy to make an effort to change himself, instead of blaming his surroundings ). Although he sees the events five years before as \"horrors\" he went through,  by better understanding what is happening to him, Zappa has been able to accept the spirits. \n"
  }
}