{
  "name": {
    "english": "Zato-ONE",
    "kanji": "ザトー＝ＯＮＥ",
    "romaji": "Zato Wan"
  },
  "alias": null,
  "image": "https://static.wikia.nocookie.net/guilty-gear/images/2/26/Zato_Guilty_Gear_Strive.png/revision/latest?cb=20220322033048",
  "profiles": {
    "race": "Human",
    "gender": "Male",
    "age": "Unknown",
    "height": "181cm(5'11\")",
    "weight": "68kg(150lbs.)",
    "blood_type": "A",
    "origin": "Spain",
    "birthday": "January 28",
    "eye_color": "Formerlyblue",
    "hobbies": "Attempting to understand the language of flowers",
    "likes": [
      "Pride (GG—GGX+)",
      "Millia (GGXrdS—)"
    ],
    "dislikes": [
      "Women",
      "Millia (GG—GGX+)"
    ]
  },
  "description": {
    "info": "Zato-ONE, alternatively spelled as Zato-1, is a recurring character in the Guilty Gear series. By sacrificing his eyesight, he became host to the Forbidden Beast Eddie and gained the ability to fight with his shadow. Zato was the rightful leader of the Assassin's Guild until his fall from grace, brought about by his former lover Millia Rage.\n",
    "design": "Zato is an attractive man, sporting long, flowing blond hair and strong features overall. To cover his eyes, Zato wears a bright red blindfold fastened by a black belt. He dresses in rather simple way having black sleeveless turtleneck, a choker, arm warmers, pants held by a belt at the waist, and combat boots. Only the buckles of his belts and boot laces differ in color, being golden and red, respectively.\nHis appearance in Xrd remains largely unchanged, simply adding silver accessories below his collarbone and the back of his hands. It features the phrases \"Walking shadow\" and \"One light free me of all the weight and pain of life\". His Strive design changes his outfit by giving him a more military-like look with padding, more belts, as well as dark brown leather harness straps and waist belt with pouches. His boots remain mostly unchanged, except that their soles are now red.\nIn Zato's idle stance, Eddie appears as a circle around at Zato's feet, and takes many forms, sometimes even covering all of Zato's body. In the Xrd games, outside of combat, Zato is able to wear Eddie in the form of a black longcoat.\n",
    "personality": "A level-headed and cruel assassin,  but also elegant,  Zato has a calm disposition, and is someone who gives each aspect of a problem great consideration. He still feels things strongly, but keeps such feelings hidden from the world.  His calm demeanor, with the implication of never seeing others on an equal footing, is a self-protection mechanism, for in truth Zato is simply an ordinary—if vain—man. \nDespite his arrogance, Zato has good intentions,  wanting to turn the guild into a place where those with nowhere else to turn after the war could take shelter,  having a certain naivety according to Venom.  Gentle and caring towards those in the same circumstances as himself,  Zato is respected by his subordinates  and by his predecessor.  However, the betrayal of Millia, the only woman he ever trusted,  and his imprisonment  made Zato grow embittered, and the affection he felt for her turned to hate. \nAfter his death and resurrection, being subjected to the breadth of human experience has burned out of Zato all capacity for emotional reaction,  even as his memories remain intact.   Unable to be emotionally moved, Zato perceives no value  or interest  in anything, including himself.  The one exception to his ennui is Millia;  as the only thing to elicit any kind of reaction from him, Zato is determined to protect Millia  and keep her safe, desiring to become stronger for her sake.  In a way, Zato has gained immense knowledge, but at the same time has reverted to being a child, and is re-learning things that others would do naturally.  He is also keenly aware that his sins are not, and never will be, cleansed. \n"
  }
}